lyusupov/SoftRF/software/firmware/source/SkyView/Platform_ESP32.cpp
/*
 * Platform_ESP32.cpp
 * Copyright (C) 2019-2026 Linar Yusupov
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */
#if defined(ESP32)

#include "sdkconfig.h"

#include <SPI.h>
#include <Wire.h>
#include <esp_err.h>
#include <esp_wifi.h>
#if !defined(CONFIG_IDF_TARGET_ESP32S2) && !defined(CONFIG_IDF_TARGET_ESP32P4)
#include <esp_bt.h>
#endif /* CONFIG_IDF_TARGET_ESP32S2 */
#if !defined(CONFIG_IDF_TARGET_ESP32C5)  && \
    !defined(CONFIG_IDF_TARGET_ESP32C6)  && \
    !defined(CONFIG_IDF_TARGET_ESP32C61) && \
    !defined(CONFIG_IDF_TARGET_ESP32H2)  && \
    !defined(CONFIG_IDF_TARGET_ESP32P4)
#include <soc/rtc_cntl_reg.h>
#endif /* CONFIG_IDF_TARGET_ESP32C5 || C6 || H2 || P4 */
#include <rom/spi_flash.h>
#include <soc/adc_channel.h>
#include <driver/i2s.h>
#include <flashchips.h>

#include "SoCHelper.h"
#include "EPDHelper.h"
#if defined(USE_TFT)
#include "TFTHelper.h"
#endif /* USE_TFT */
#include "EEPROMHelper.h"
#include "WiFiHelper.h"
#include "BluetoothHelper.h"

#include "SkyView.h"

#include <battery.h>

#if defined(CONFIG_IDF_TARGET_ESP32)   || \
    defined(CONFIG_IDF_TARGET_ESP32S2) || \
    defined(CONFIG_IDF_TARGET_ESP32C3) || \
    defined(CONFIG_IDF_TARGET_ESP32C5) || \
    defined(CONFIG_IDF_TARGET_ESP32C6) || \
    defined(CONFIG_IDF_TARGET_ESP32P4)
#include <sqlite3.h>
#include <SD.h>
#endif /* CONFIG_IDF_TARGET_ESP32XX */

#if defined(ESP_IDF_VERSION_MAJOR) && ESP_IDF_VERSION_MAJOR>=5
#include <esp_mac.h>
#include <esp_flash.h>
#include <esp_wifi_ap_get_sta_list.h>
#endif /* ESP_IDF_VERSION_MAJOR */

#define uS_TO_S_FACTOR 1000000  /* Conversion factor for micro seconds to seconds */
#define TIME_TO_SLEEP  28        /* Time ESP32 will go to sleep (in seconds) */

#if defined(EXCLUDE_WIFI)
char UDPpacketBuffer[UDP_PACKET_BUFSIZE]; // Dummy definition to satisfy build sequence
#else
WebServer server ( 80 );
#endif /* EXCLUDE_WIFI */

#if !defined(EXCLUDE_ETHERNET)
#include <ETH.h>
#include "EthernetHelper.h"
#endif /* EXCLUDE_ETHERNET */

/*
 * TTGO-T5S. Pin definition

#define BUSY_PIN        4
#define CS_PIN          5
#define RST_PIN         16
#define DC_PIN          17
#define SCK_PIN         18
#define MOSI_PIN        23

P1-1                    21
P1-2                    22 (LED)

I2S MAX98357A           26
                        25
                        19

I2S MIC                 27
                        32
                        33

B0                      RST
B1                      38
B2                      37
B3                      39

SD                      2
                        13
                        14
                        15

P2                      0
                        12
                        13
                        RXD
                        TXD
                        34
                        35 (BAT)
 */
GxEPD2_BW<GxEPD2_270, GxEPD2_270::HEIGHT> epd_ttgo_t5s_W3(GxEPD2_270(
                                          /*CS=*/   SOC_GPIO_PIN_SS_T5S,
                                          /*DC=*/   SOC_EPD_PIN_DC_T5S,
                                          /*RST=*/  SOC_EPD_PIN_RST_T5S,
                                          /*BUSY=*/ SOC_EPD_PIN_BUSY_T5S
                                          ));
GxEPD2_BW<GxEPD2_270_T91, GxEPD2_270_T91::HEIGHT> epd_ttgo_t5s_T91(GxEPD2_270_T91(
                                                  /*CS=*/   SOC_GPIO_PIN_SS_T5S,
                                                  /*DC=*/   SOC_EPD_PIN_DC_T5S,
                                                  /*RST=*/  SOC_EPD_PIN_RST_T5S,
                                                  /*BUSY=*/ SOC_EPD_PIN_BUSY_T5S
                                                  ));
/*
 * Waveshare E-Paper ESP32 Driver Board

#define SCK_PIN         13
#define MOSI_PIN        14
#define CS_PIN          15
#define BUSY_PIN        25
#define RST_PIN         26
#define DC_PIN          27

B1                      0
LED                     2

RX0, TX0                3,1

P                       0,2,4,5,12,13,14,15,16,17,18,19,21,22,23,25,26,27,32,33,34,35
 */
GxEPD2_BW<GxEPD2_270, GxEPD2_270::HEIGHT> epd_waveshare_W3(GxEPD2_270(
                                          /*CS=*/   SOC_GPIO_PIN_SS_WS,
                                          /*DC=*/   SOC_EPD_PIN_DC_WS,
                                          /*RST=*/  SOC_EPD_PIN_RST_WS,
                                          /*BUSY=*/ SOC_EPD_PIN_BUSY_WS
                                          ));

GxEPD2_BW<GxEPD2_270_T91, GxEPD2_270_T91::HEIGHT> epd_waveshare_T91(GxEPD2_270_T91(
                                                  /*CS=*/   SOC_GPIO_PIN_SS_WS,
                                                  /*DC=*/   SOC_EPD_PIN_DC_WS,
                                                  /*RST=*/  SOC_EPD_PIN_RST_WS,
                                                  /*BUSY=*/ SOC_EPD_PIN_BUSY_WS
                                                  ));

static union {
  uint8_t efuse_mac[6];
  uint64_t chipmacid;
};

#if defined(CONFIG_IDF_TARGET_ESP32) || defined(CONFIG_IDF_TARGET_ESP32P4)
#if SOC_SDMMC_IO_POWER_EXTERNAL
#include "esp_ldo_regulator.h"
#endif /* SOC_SDMMC_IO_POWER_EXTERNAL */

static sqlite3 *fln_db  = NULL;
static sqlite3 *ogn_db  = NULL;
static sqlite3 *icao_db = NULL;

static uint8_t sdcard_files_to_open = 0;

