lyusupov/SoftRF/software/firmware/source/SkyView/Platform_ESP32.cpp
  ret = esp_efuse_mac_get_custom(efuse_mac);
  if (ret != ESP_OK) {
      ESP_LOGE(TAG_MAC, "Get base MAC address from BLK3 of EFUSE error (%s)", esp_err_to_name(ret));
    /* If get custom base MAC address error, the application developer can decide what to do:
     * abort or use the default base MAC address which is stored in BLK0 of EFUSE by doing
     * nothing.
     */

    ESP_LOGI(TAG_MAC, "Use base MAC address which is stored in BLK0 of EFUSE");
    chipmacid = ESP.getEfuseMac();
  } else {
    if (memcmp(efuse_mac, null_mac, 6) == 0) {
      ESP_LOGI(TAG_MAC, "Use base MAC address which is stored in BLK0 of EFUSE");
      chipmacid = ESP.getEfuseMac();
    }
  }

#if defined(ESP_IDF_VERSION_MAJOR) && ESP_IDF_VERSION_MAJOR>=5
  size_t flash_size;
  esp_flash_get_size(NULL, (uint32_t *) &flash_size);
#else
  size_t flash_size = spi_flash_get_chip_size();
#endif /* ESP_IDF_VERSION_MAJOR */

  size_t min_app_size = flash_size;

  esp_partition_iterator_t it;
  const esp_partition_t *part;

  it = esp_partition_find(ESP_PARTITION_TYPE_APP, ESP_PARTITION_SUBTYPE_ANY, NULL);
  if (it) {
    do {
      part = esp_partition_get(it);
      if (part->subtype == ESP_PARTITION_SUBTYPE_APP_FACTORY) {
        continue;
      }
      if (part->size < min_app_size) {
        min_app_size = part->size;
      }
    } while (it = esp_partition_next(it));

    if (it) esp_partition_iterator_release(it);
  }

  if (min_app_size && (min_app_size != flash_size)) {
    ESP32_Min_AppPart_Size = min_app_size;
  }

  uint32_t flash_id = ESP32_getFlashId();

  /*
   *    Board             |   Module         |  Flash memory IC
   *  --------------------+------------------+--------------------
   *  DoIt ESP32          | WROOM            | GIGADEVICE_GD25Q32
   *  TTGO T3  V2.0       | PICO-D4 IC       | GIGADEVICE_GD25Q32
   *  TTGO T3  V2.1.6     | PICO-D4 IC       | GIGADEVICE_GD25Q32
   *  TTGO T22 V06        |                  | WINBOND_NEX_W25Q32_V
   *  TTGO T22 V08        |                  | WINBOND_NEX_W25Q32_V
   *  TTGO T22 V11        |                  | BOYA_BY25Q32AL
   *  TTGO T22 V12        |                  | WINBOND_NEX_W25Q32_V
   *  TTGO T8  V1.8       | WROVER           | GIGADEVICE_GD25LQ32
   *  TTGO T8 S2 V1.1     |                  | WINBOND_NEX_W25Q32_V
   *  TTGO T5S V1.9       |                  | WINBOND_NEX_W25Q32_V
   *  TTGO T5S V2.8       |                  | BOYA_BY25Q32AL
   *  TTGO T5  4.7        | WROVER-E         | XMC_XM25QH128C
   *  TTGO T-Watch        |                  | WINBOND_NEX_W25Q128_V
   *  Ai-T NodeMCU-S3     | ESP-S3-12K       | GIGADEVICE_GD25Q64C
   *  TTGO T-Dongle       |                  | BOYA_BY25Q32AL
   *  TTGO S3 Core        |                  | GIGADEVICE_GD25Q64C
   *  TTGO T-01C3         |                  | BOYA_BY25Q32AL
   *                      | ESP-C3-12F       | XMC_XM25QH32B
   *  LilyGO T-TWR        | WROOM-1-N16R8    | GIGADEVICE_GD25Q128
   *  Heltec Tracker      |                  | GIGADEVICE_GD25Q64
   *                      | WT0132C6-S5      | ZBIT_ZB25VQ32B
   *  LilyGO T3-C6        | ESP32-C6-MINI    | XMC_XM25QH32B
   *  LilyGO T3-S3-EP     | ESP32-S3-MINI    | XMC_XM25QH32B
   *  LilyGO T3-S3-OL     | ESP32-S3FH4R2    |
   *  Elecrow TN-M2       | ESP32-S3-N4R8    | ZBIT_ZB25VQ32B
   *  RadioMaster XR1     | ESP32-C3 (QFN32) | XMC_XM25QH32B
   *  RadioMaster XR1     |                  | 0x464016 (TBD)
   *  Elecrow TN-M5       | ESP32-S3-N4R8    | 0x464016 (TBD)
   *  Ebyte EoRa-HUB      | ESP32-S3FH4R2    |
   *  WT99P4C5-S1 CPU     | WT0132P4-A1      | ZBIT_ZB25VQ128ASIG
   *  WT99P4C5-S1 NCU     | ESP32-C5-WROOM-1 | XMC_XM25QH64B
   *  LilyGO T-Display P4 |                  | GIGADEVICE_GD25Q128
   */

  if (psramFound()) {
    switch(flash_id)
    {
    case MakeFlashId(GIGADEVICE_ID, GIGADEVICE_GD25LQ32):
      /* ESP32-WROVER module */
      hw_info.revision = HW_REV_T8_1_8;
      break;
    case MakeFlashId(ST_ID, XMC_XM25QH128C):
      /* custom ESP32-WROVER-E module with 16 MB flash */
      hw_info.revision = HW_REV_T5_1;
      break;
#if defined(CONFIG_IDF_TARGET_ESP32S3)
    case MakeFlashId(WINBOND_NEX_ID, WINBOND_NEX_W25Q64_V): /* BPI */
    case MakeFlashId(WINBOND_NEX_ID, WINBOND_NEX_W25Q64_W): /* TBD */
      hw_info.revision = HW_REV_BPI;
      break;
    case MakeFlashId(GIGADEVICE_ID, GIGADEVICE_GD25Q64):
      hw_info.revision = HW_REV_DEVKIT;
      break;
#endif /* CONFIG_IDF_TARGET_ESP32S3 */
#if defined(CONFIG_IDF_TARGET_ESP32P4)
    case MakeFlashId(GIGADEVICE_ID, GIGADEVICE_GD25Q128):
      hw_info.revision = HW_REV_TDISPLAY_P4_TFT;
      break;
    case MakeFlashId(ZBIT_ID, ZBIT_ZB25VQ128A): /* WT0132P4-A1 ESP32-P4NRW32 */
      hw_info.revision = HW_REV_DEVKIT;
      break;
#endif /* CONFIG_IDF_TARGET_ESP32P4 */
    default:
      hw_info.revision = HW_REV_UNKNOWN;
      break;
    }
  } else {
    switch(flash_id)
    {
    case MakeFlashId(GIGADEVICE_ID, GIGADEVICE_GD25Q32):
      hw_info.revision = HW_REV_DEVKIT;
      break;
    case MakeFlashId(WINBOND_NEX_ID, WINBOND_NEX_W25Q32_V):
      hw_info.revision = HW_REV_T5S_1_9;
      break;
    case MakeFlashId(BOYA_ID, BOYA_BY25Q32AL):
      hw_info.revision = HW_REV_T5S_2_8;
      break;
    default:
      hw_info.revision = HW_REV_UNKNOWN;
      break;
    }
  }

#if defined(CONFIG_IDF_TARGET_ESP32S3)
  Wire.setPins(SOC_GPIO_PIN_SDA, SOC_GPIO_PIN_SCL);
  Wire.begin();
  Wire.beginTransmission(INA219_ADDRESS_ALT);
  ESP32_has_CPM = (Wire.endTransmission() == 0);
  Wire.end();

  if (ESP32_has_CPM) {
    ina219.begin(&Wire);
    ina219.setCalibration_16V_400mA();
  }

  ESP32_has_spiflash = SPIFlash->begin(possible_devices,
                                       EXTERNAL_FLASH_DEVICE_COUNT);
  if (ESP32_has_spiflash) {
    spiflash_id = SPIFlash->getJEDECID();

    uint32_t capacity = spiflash_id & 0xFF;
    if (capacity >= 0x17) { /* equal or greater than 1UL << 23 (8 MiB) */
#if CONFIG_TINYUSB_MSC_ENABLED
  #if defined(USE_ADAFRUIT_MSC)
      // Set disk vendor id, product id and revision
      // with string up to 8, 16, 4 characters respectively
      usb_msc.setID(ESP32SX_Device_Manufacturer, "Internal Flash", "1.0");

      // Set callback
      usb_msc.setReadWriteCallback(ESP32_msc_read_cb,
                                   ESP32_msc_write_cb,
                                   ESP32_msc_flush_cb);

