lyusupov/SoftRF/software/firmware/source/SkyView/Platform_ESP32.cpp
      // Set disk size, block size should be 512 regardless of spi flash page size
      usb_msc.setCapacity(SPIFlash->size()/512, 512);

      // MSC is ready for read/write
      usb_msc.setUnitReady(true);

      usb_msc.begin();

  #else

      // Set disk vendor id, product id and revision
      // with string up to 8, 16, 4 characters respectively
      usb_msc.vendorID(ESP32SX_Device_Manufacturer);
      usb_msc.productID("Internal Flash");
      usb_msc.productRevision("1.0");

      // Set callback
      usb_msc.onRead(ESP32_msc_read_cb);
      usb_msc.onWrite(ESP32_msc_write_cb);

      // MSC is ready for read/write
      usb_msc.mediaPresent(true);

      // Set disk size, block size should be 512 regardless of spi flash page size
      usb_msc.begin(SPIFlash->size()/512, 512);
  #endif /* USE_ADAFRUIT_MSC */
#endif /* CONFIG_TINYUSB_MSC_ENABLED */

      FATFS_is_mounted = fatfs.begin(SPIFlash);
      hw_info.storage  = FATFS_is_mounted ? STORAGE_FLASH : STORAGE_NONE;
    }
  }

#if !defined(EXCLUDE_AUDIO)
  Audio_Gen    = new AudioGeneratorWAV();
  Audio_Source = new AudioFileSourceSdFat(fatfs);

#if defined(USE_EXT_I2S_DAC)
  Audio_Sink   = new AudioOutputI2S(0, AudioOutputI2S::EXTERNAL_I2S);
  Audio_Sink->SetPinout(SOC_GPIO_PIN_BCK,
                        SOC_GPIO_PIN_LRCK,
                        SOC_GPIO_PIN_DATA,
                        SOC_GPIO_PIN_MCK);
#else
  Audio_Sink   = new AudioOutputI2S(0, AudioOutputI2S::INTERNAL_PDM);
  Audio_Sink->SetPinout(I2S_PIN_NO_CHANGE,
                        I2S_PIN_NO_CHANGE,
                        SOC_GPIO_PIN_PDM_OUT,
                        I2S_PIN_NO_CHANGE);
#endif /* USE_EXT_I2S_DAC */

  Audio_Sink->SetOutputModeMono(true);
  Audio_Sink->SetChannels(1);
#if SOC_GPIO_PIN_MCK != I2S_PIN_NO_CHANGE
  Audio_Sink->SetMclk(true);
#else
  Audio_Sink->SetMclk(false);
#endif /* SOC_GPIO_PIN_MCK */
#endif /* EXCLUDE_AUDIO */

  pinMode(SOC_GPIO_PIN_LED, OUTPUT);
  /* Indicate positive power supply */
  digitalWrite(SOC_GPIO_PIN_LED, LED_STATE_ON);

#endif /* CONFIG_IDF_TARGET_ESP32S3 */

#if ARDUINO_USB_CDC_ON_BOOT && \
    (defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3))
#if CONFIG_TINYUSB_ENABLED
  if (USB.manufacturerName(ESP32SX_Device_Manufacturer)) {
    char usb_serial_number[16];
    uint16_t pid = 0x812B ; /* Banana Pi BPI-PicoW-S3 - Arduino */

    snprintf(usb_serial_number, sizeof(usb_serial_number),
             "%02X%02X%02X%02X%02X%02X",
             efuse_mac[0], efuse_mac[1], efuse_mac[2],
             efuse_mac[3], efuse_mac[4], efuse_mac[5]);

    USB.VID(USB_VID); // USB_ESPRESSIF_VID = 0x303A
    USB.PID(pid);
    USB.productName(ESP32SX_Device_Model);
    USB.firmwareVersion(ESP32SX_Device_Version);
    USB.serialNumber(usb_serial_number);
    USB.begin();
  }
#endif /* CONFIG_TINYUSB_ENABLED */

  Serial.begin(SERIAL_OUT_BR);

  for (int i=0; i < 20; i++) {if (Serial) break; else delay(100);}

#if 0 /* TBD */
  if (Serial.rebootEnabled()) {
    Serial.enableReboot(false);
  }
#endif /* TBD */

#else
#if ARDUINO_USB_CDC_ON_BOOT && \
    (defined(CONFIG_IDF_TARGET_ESP32C5) || \
     defined(CONFIG_IDF_TARGET_ESP32C6) || \
     defined(CONFIG_IDF_TARGET_ESP32P4))
  Serial.begin(SERIAL_OUT_BR);
#else
  Serial.begin(SERIAL_OUT_BR, SERIAL_OUT_BITS);
#endif /* CONFIG_IDF_TARGET_ESP32C6 */
#endif /* ARDUINO_USB_CDC_ON_BOOT && (CONFIG_IDF_TARGET_ESP32S2 || S3) */

#if defined(CONFIG_IDF_TARGET_ESP32P4)
  Wire.begin(SOC_GPIO_PIN_SDA, SOC_GPIO_PIN_SCL);

  // Wire.beginTransmission(GT911_ADDRESS);
  // if (Wire.endTransmission() == 0) hw_info.revision = HW_REV_DEVKIT;
  // Wire.beginTransmission(GT911_ADDRESS_ALT);
  // if (Wire.endTransmission() == 0) hw_info.revision = HW_REV_DEVKIT;

  Wire.beginTransmission(BQ27220_SLAVE_ADDRESS);
  bool has_bq27220 = (Wire.endTransmission() == 0);
  if (has_bq27220 && bq_27220.begin(Wire,
                                    SOC_GPIO_PIN_TDP4_SDA,
                                    SOC_GPIO_PIN_TDP4_SCL)) {
    ESP32_has_CPM = true;
  }

  switch (hw_info.revision)
  {
  case HW_REV_TDISPLAY_P4_TFT:
  case HW_REV_TDISPLAY_P4_AMOLED:

    pinMode(SOC_GPIO_PIN_TDP4_XL9, INPUT); /* INT */

    xl9535 = new ExtensionIOXL9555();
    ESP32_has_gpio_extension = xl9535->begin(Wire, XL9535_ADDRESS,
                                             SOC_GPIO_PIN_SDA,
                                             SOC_GPIO_PIN_SCL);
    if (ESP32_has_gpio_extension) {
      /* make GNSS inactive prior to 3.3V power ON */
      xl9535->digitalWrite(ExtensionIOXL9555::SOC_EXPIO_TDP4_GNSS_WKE, LOW);
      xl9535->pinMode(ExtensionIOXL9555::SOC_EXPIO_TDP4_GNSS_WKE, OUTPUT);

      /* make ESP32-C6 inactive prior to 3.3V power ON */
      xl9535->digitalWrite(ExtensionIOXL9555::SOC_EXPIO_TDP4_SLAVE_EN, LOW);
      xl9535->pinMode(ExtensionIOXL9555::SOC_EXPIO_TDP4_SLAVE_EN, OUTPUT);

      /* USB PHY power */
      xl9535->digitalWrite(ExtensionIOXL9555::SOC_EXPIO_TDP4_VCCA_EN,  LOW);
      xl9535->pinMode(ExtensionIOXL9555::SOC_EXPIO_TDP4_VCCA_EN,  OUTPUT);

      /*
       * Turn ON power of
       * GNSS, TFT back light, ESP32-C6,
       * camera (SGM38121), haptic (AW86224), IMU (ICM20948),
       * ETH PHY and ES8311 digital circuits
       */
      xl9535->digitalWrite(ExtensionIOXL9555::SOC_EXPIO_TDP4_3V3_EN,   LOW);

      /* Power of NS4150 audio amp. and ES8311 analog circuits */
      xl9535->digitalWrite(ExtensionIOXL9555::SOC_EXPIO_TDP4_5V0_EN,   HIGH);

      xl9535->pinMode(ExtensionIOXL9555::SOC_EXPIO_TDP4_3V3_EN,   OUTPUT);
      xl9535->pinMode(ExtensionIOXL9555::SOC_EXPIO_TDP4_5V0_EN,   OUTPUT);

      /* Power of micro-SD */
      xl9535->digitalWrite(ExtensionIOXL9555::SOC_EXPIO_TDP4_SD_EN,    LOW);
      xl9535->pinMode(ExtensionIOXL9555::SOC_EXPIO_TDP4_SD_EN,    OUTPUT);

      xl9535->digitalWrite(ExtensionIOXL9555::SOC_EXPIO_TDP4_DSI_RST,  HIGH);
      xl9535->digitalWrite(ExtensionIOXL9555::SOC_EXPIO_TDP4_TP_RST,   HIGH);
      xl9535->pinMode(ExtensionIOXL9555::SOC_EXPIO_TDP4_DSI_RST,  OUTPUT);
      xl9535->pinMode(ExtensionIOXL9555::SOC_EXPIO_TDP4_TP_RST,   OUTPUT);

