lyusupov/SoftRF/software/firmware/source/SkyView/Platform_ESP32.cpp
      delay(200);

      xl9535->digitalWrite(ExtensionIOXL9555::SOC_EXPIO_TDP4_SLAVE_EN, HIGH);
      /* Wake up Quectel L76K GNSS */
      xl9535->digitalWrite(ExtensionIOXL9555::SOC_EXPIO_TDP4_GNSS_WKE, HIGH);

      Wire.beginTransmission(GT9895_ADDRESS);
      if (Wire.endTransmission() == 0) hw_info.revision = HW_REV_TDISPLAY_P4_AMOLED;
      Wire.beginTransmission(HI8561_ADDRESS);
      if (Wire.endTransmission() == 0) hw_info.revision = HW_REV_TDISPLAY_P4_TFT;
    }

    // I2C #2 (ES8311, AW86224, SGM38121, ICM20948, Camera)
    Wire1.begin(SOC_GPIO_PIN_TDP4_SDA, SOC_GPIO_PIN_TDP4_SCL);

#if SOC_SDMMC_IO_POWER_EXTERNAL
    {
      esp_ldo_channel_handle_t ldo_sdio = NULL;
      esp_ldo_channel_config_t ldo_sdio_config = {
          .chan_id = BOARD_SDMMC_POWER_CHANNEL,
          .voltage_mv = 3300,
      };
      esp_ldo_acquire_channel(&ldo_sdio_config, &ldo_sdio);
    }
#endif /* SOC_SDMMC_IO_POWER_EXTERNAL */

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 4, 0)
    pin_config.mck_io_num   = SOC_GPIO_PIN_TDP4_MCK;
#endif
    pin_config.bck_io_num   = SOC_GPIO_PIN_TDP4_BCK;
    pin_config.ws_io_num    = SOC_GPIO_PIN_TDP4_LR;
    pin_config.data_out_num = SOC_GPIO_PIN_TDP4_DO;

    es8311_codec_init(1);
    break;

  case HW_REV_DEVKIT:
  default:
    pinMode(SOC_GPIO_PIN_PAMP_EN,      OUTPUT);
    digitalWrite(SOC_GPIO_PIN_PAMP_EN, HIGH);

#if SOC_SDMMC_IO_POWER_EXTERNAL
    {
      esp_ldo_channel_handle_t ldo_sdio = NULL;
      esp_ldo_channel_config_t ldo_sdio_config = {
          .chan_id = BOARD_SDMMC_POWER_CHANNEL,
          .voltage_mv = 3300,
      };
      esp_ldo_acquire_channel(&ldo_sdio_config, &ldo_sdio);
    }
#endif /* SOC_SDMMC_IO_POWER_EXTERNAL */

    es8311_codec_init(0);
    break;
  }

#if !defined(EXCLUDE_ETHERNET)
  Ethernet_setup();

  ETH.begin(ETH_PHY_TYPE,
            ETH_PHY_ADDR,
            SOC_GPIO_PIN_ETH_MDC,
            SOC_GPIO_PIN_ETH_MDIO,
            SOC_GPIO_PIN_ETH_PWR,
            ETH_CLK_MODE);
#endif /* EXCLUDE_ETHERNET */

  /* SD-SPI init */
  uSD_SPI.begin(SOC_GPIO_PIN_SD_CLK,
                SOC_GPIO_PIN_SD_D0,
                SOC_GPIO_PIN_SD_CMD,
                SOC_GPIO_PIN_SD_D3);

#endif /* CONFIG_IDF_TARGET_ESP32P4 */
}

static void ESP32_post_init()
{
  uint32_t SerialBaud;

  switch (settings->baudrate)
  {
  case B4800:
    SerialBaud = 4800;
    break;
  case B9600:
    SerialBaud = 9600;
    break;
  case B19200:
    SerialBaud = 19200;
    break;
  case B57600:
    SerialBaud = 57600;
    break;
  case B115200:
    SerialBaud = 115200;
    break;
  case B2000000:
    SerialBaud = 2000000;
    break;
  case B38400:
  default:
    SerialBaud = 38400;
    break;
  }

  Serial.println();

  Serial.print(F("Board        : "));

  switch (hw_info.revision)
  {
  case HW_REV_T5S_1_9            : Serial.println(F("LilyGO T5S"));                 break;
  case HW_REV_T5S_2_8            : Serial.println(F("LilyGO T5S"));                 break;
  case HW_REV_BPI                : Serial.println(F("Banana PicoW"));               break;
  case HW_REV_TDISPLAY_P4_TFT    : Serial.println(F("LilyGO T-Display-P4 TFT"));    break;
  case HW_REV_TDISPLAY_P4_AMOLED : Serial.println(F("LilyGO T-Display-P4 AMOLED")); break;
  case HW_REV_DEVKIT             : Serial.print(SoC->name);
                                   Serial.println(F(" DevKit"));                    break;
  default                        : Serial.println(F("OTHER"));                      break;
  }

  Serial.print(F("Display      : "));

  if (hw_info.display == DISPLAY_TFT_7_0) {
    Serial.println(F("7 inch TFT"));
  } else if (hw_info.display == DISPLAY_TFT_4_05) {
    Serial.println(F("4 inch TFT"));
  } else if (hw_info.display == DISPLAY_AMOLED_4_1) {
    Serial.println(F("4.1 inch AMOLED"));
  } else if (hw_info.display != DISPLAY_EPD_2_7 || display == NULL) {
    Serial.println(F("NONE"));
  } else {
    switch (display->epd2.panel)
    {
    case GxEPD2::GDEY027T91: Serial.println(F("GDEY027T91")); break;
    case GxEPD2::GDEW027W3 : Serial.println(F("GDEW027W3"));  break;
    default                : Serial.println(F("OTHER"));      break;
    }
  }

  Serial.println();

  Serial.print(F("Input source : "));
  switch (settings->connection)
  {
    case CON_SERIAL_MAIN   : Serial.print  (F("UART MAIN "));
                             Serial.println(SerialBaud);    break;
    case CON_SERIAL_AUX    : Serial.print  (F("UART AUX "));
                             Serial.println(SerialBaud);    break;
    case CON_USB           : Serial.println(F("USB"));      break;
    case CON_WIFI_UDP      : Serial.println(F("WIFI UDP")); break;
    case CON_WIFI_TCP      : Serial.println(F("WIFI TCP")); break;
    case CON_BLUETOOTH_SPP : Serial.println(F("BT SPP"));   break;
    case CON_BLUETOOTH_LE  : Serial.println(F("BT LE"));    break;
    case CON_NONE          :
    default                : Serial.println(F("NONE"));     break;
  }

  Serial.print(F("Protocol     : "));
  switch (settings->protocol)
  {
    case PROTOCOL_NMEA     : Serial.println(F("NMEA"));     break;
    case PROTOCOL_GDL90    : Serial.println(F("GDL90"));    break;
    case PROTOCOL_D1090    : Serial.println(F("D1090"));    break;
    case PROTOCOL_NONE     :
    default                : Serial.println(F("NONE"));     break;
  }

  Serial.println();
  Serial.flush();
}

static void ESP32_loop()
{
#if defined(CONFIG_IDF_TARGET_ESP32S3)
  if (Battery_voltage() > Battery_threshold()) {
    /* Indicate positive power supply */
    if (digitalRead(SOC_GPIO_PIN_LED) != LED_STATE_ON) {
      digitalWrite(SOC_GPIO_PIN_LED, LED_STATE_ON);
    }
  } else {
    if (isTimeToToggle()) {
      digitalWrite(SOC_GPIO_PIN_LED, !digitalRead(SOC_GPIO_PIN_LED) ?
                                     HIGH : LOW);  // toggle state
      status_LED_TimeMarker = millis();
    }
  }
#endif /* CONFIG_IDF_TARGET_ESP32S3 */

#if defined(CONFIG_IDF_TARGET_ESP32P4)
#if !defined(EXCLUDE_ETHERNET)
  Ethernet_loop();
#endif /* EXCLUDE_ETHERNET */
#endif /* CONFIG_IDF_TARGET_ESP32P4 */
}

