lyusupov/SoftRF/software/firmware/source/SkyView/Platform_ESP32.cpp
static void ESP32_fini()
{
#if defined(CONFIG_IDF_TARGET_ESP32S3)
  if (ESP32_has_spiflash) {
#if CONFIG_TINYUSB_MSC_ENABLED
  #if defined(USE_ADAFRUIT_MSC)
    usb_msc.setUnitReady(false);
//  usb_msc.end(); /* N/A */
  #else
    usb_msc.mediaPresent(false);
    usb_msc.end();
  #endif /* USE_ADAFRUIT_MSC */
#endif /* CONFIG_TINYUSB_MSC_ENABLED */
  }

  if (SPIFlash != NULL) SPIFlash->end();

  if (ESP32_has_CPM) {
    ina219.powerSave(true);
    Wire.end();
  }

  pinMode(SOC_GPIO_PIN_LED, INPUT);
#endif /* CONFIG_IDF_TARGET_ESP32S3 */

#if defined(CONFIG_IDF_TARGET_ESP32P4)
#if !defined(EXCLUDE_ETHERNET)
  ETH.end();

  Ethernet_fini();
#endif /* EXCLUDE_ETHERNET */
#endif /* CONFIG_IDF_TARGET_ESP32P4 */

  int wake_gpio_num = SOC_BUTTON_MODE_DEF;

#if defined(CONFIG_IDF_TARGET_ESP32)
  if (settings && (settings->adapter == ADAPTER_TTGO_T5S)) {
    uSD_SPI.end();
    wake_gpio_num = SOC_BUTTON_MODE_T5S;
  }
#endif /* CONFIG_IDF_TARGET_ESP32 */

#if defined(CONFIG_IDF_TARGET_ESP32S3)
  if (settings &&
      (settings->adapter == ADAPTER_WAVESHARE_PICO_2_7 ||
       settings->adapter == ADAPTER_WAVESHARE_PICO_2_7_V2)) {
    wake_gpio_num = SOC_GPIO_PIN_KEY1; // RTC GPIO

    if (rtc_gpio_is_valid_gpio((gpio_num_t) wake_gpio_num)) {
      esp_sleep_pd_config(ESP_PD_DOMAIN_RTC_PERIPH, ESP_PD_OPTION_ON);
      rtc_gpio_pulldown_dis((gpio_num_t) wake_gpio_num);
      rtc_gpio_pullup_en((gpio_num_t) wake_gpio_num);
    }
  }
#endif /* CONFIG_IDF_TARGET_ESP32S3 */

  esp_wifi_stop();

#if defined(CONFIG_IDF_TARGET_ESP32)
  esp_bt_controller_disable();
#endif /* CONFIG_IDF_TARGET_ESP32 */

//  SPI.end(); // done in EPD_fini

  /*
   * manually apply this fix onto Arduino Core for ESP32:
   * https://github.com/espressif/arduino-esp32/pull/4272
   * to put SD card into idle state
   *
   *  SkyView EZ sleep current (from 3.7V battery source):
   *  ---------------------------------------------------
   *  SD card in  -            0.2 mA
   *  SD card out -            0.1 mA
   */
#if !defined(CONFIG_IDF_TARGET_ESP32C3) && !defined(CONFIG_IDF_TARGET_ESP32C5) && \
    !defined(CONFIG_IDF_TARGET_ESP32C6)
  esp_sleep_enable_ext1_wakeup(1ULL << wake_gpio_num, ESP_EXT1_WAKEUP_ALL_LOW);
#endif /* CONFIG_IDF_TARGET_ESP32C3 || CONFIG_IDF_TARGET_ESP32C6 */

//  Serial.println("Going to sleep now");
//  Serial.flush();

  esp_deep_sleep_start();
}

static void ESP32_reset()
{
  ESP.restart();
}

static uint32_t ESP32_getChipId()
{
  return (uint32_t) efuse_mac[5]        | (efuse_mac[4] << 8) | \
                   (efuse_mac[3] << 16) | (efuse_mac[2] << 24);
}

static uint32_t ESP32_getFreeHeap()
{
  return ESP.getFreeHeap();
}

static bool ESP32_EEPROM_begin(size_t size)
{
  return EEPROM.begin(size);
}

static void ESP32_EEPROM_extension(int cmd)
{
#if defined(CONFIG_IDF_TARGET_ESP32P4)
  if (cmd == EEPROM_EXT_LOAD || cmd == EEPROM_EXT_DEFAULTS) {
    switch (hw_info.revision)
    {
    case HW_REV_TDISPLAY_P4_TFT:
    case HW_REV_TDISPLAY_P4_AMOLED:
      settings->adapter = ADAPTER_MIPI_DSI;
      if (cmd == EEPROM_EXT_DEFAULTS) { settings->baudrate = B115200; }
      break;
    case HW_REV_DEVKIT:
    default:
      break;
    }
  }
#endif /* CONFIG_IDF_TARGET_ESP32P4 */
}

static const int8_t ESP32_dB_to_power_level[21] = {
  8,  /* 2    dB, #0 */
  8,  /* 2    dB, #1 */
  8,  /* 2    dB, #2 */
  8,  /* 2    dB, #3 */
  8,  /* 2    dB, #4 */
  20, /* 5    dB, #5 */
  20, /* 5    dB, #6 */
  28, /* 7    dB, #7 */
  28, /* 7    dB, #8 */
  34, /* 8.5  dB, #9 */
  34, /* 8.5  dB, #10 */
  44, /* 11   dB, #11 */
  44, /* 11   dB, #12 */
  52, /* 13   dB, #13 */
  52, /* 13   dB, #14 */
  60, /* 15   dB, #15 */
  60, /* 15   dB, #16 */
  68, /* 17   dB, #17 */
  74, /* 18.5 dB, #18 */
  76, /* 19   dB, #19 */
  78  /* 19.5 dB, #20 */
};

static void ESP32_WiFi_setOutputPower(int dB)
{
  if (dB > 20) {
    dB = 20;
  }

  if (dB < 0) {
    dB = 0;
  }

  ESP_ERROR_CHECK(esp_wifi_set_max_tx_power(ESP32_dB_to_power_level[dB]));
}

static bool ESP32_WiFi_hostname(String aHostname)
{
  return WiFi.setHostname(aHostname.c_str());
}

static void ESP32_swSer_begin(unsigned long baud)
{
  switch (hw_info.revision)
  {
#if defined(CONFIG_IDF_TARGET_ESP32P4)
  case HW_REV_TDISPLAY_P4_TFT:
  case HW_REV_TDISPLAY_P4_AMOLED:
    SerialInput.begin(baud, SERIAL_8N1, SOC_GPIO_PIN_TDP4_GNSS_RX, SOC_GPIO_PIN_TDP4_GNSS_TX);
    break;
#endif /* CONFIG_IDF_TARGET_ESP32P4 */
  case HW_REV_DEVKIT:
  default:
    SerialInput.begin(baud, SERIAL_8N1, SOC_GPIO_PIN_GNSS_RX, SOC_GPIO_PIN_GNSS_TX);
    break;
  }

  SerialInput.setRxBufferSize(baud / 10); /* 1 second */
}

static void ESP32_swSer_enableRx(boolean arg)
{

}

static uint32_t ESP32_maxSketchSpace()
{
  return ESP32_Min_AppPart_Size ?
         ESP32_Min_AppPart_Size : 0x1E0000; /* min_spiffs.csv */
}

static void ESP32_WiFiUDP_stopAll()
{
/* not implemented yet */
}

static void ESP32_Battery_setup()
{
#if !defined(ESP_IDF_VERSION_MAJOR) || ESP_IDF_VERSION_MAJOR < 5
#if defined(CONFIG_IDF_TARGET_ESP32)
  calibrate_voltage(settings->adapter == ADAPTER_TTGO_T5S ?
                    (adc1_channel_t) ADC1_GPIO35_CHANNEL  :
                    (adc1_channel_t) ADC1_GPIO36_CHANNEL);
#elif defined(CONFIG_IDF_TARGET_ESP32S2)
  calibrate_voltage((adc1_channel_t) ADC1_GPIO9_CHANNEL); /* TBD */
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
  calibrate_voltage((adc1_channel_t) ADC1_GPIO3_CHANNEL);
#elif defined(CONFIG_IDF_TARGET_ESP32C3)
  calibrate_voltage((adc1_channel_t) ADC1_GPIO1_CHANNEL); /* TBD */
#else
#error "This ESP32 family build variant is not supported!"
#endif /* CONFIG_IDF_TARGET_ESP32 */
#else
#if defined(CONFIG_IDF_TARGET_ESP32C5) || defined(CONFIG_IDF_TARGET_ESP32P4)
  if (hw_info.revision != HW_REV_TDISPLAY_P4_TFT &&
      hw_info.revision != HW_REV_TDISPLAY_P4_AMOLED) {
    calibrate_voltage(SOC_GPIO_PIN_BATTERY);
  }
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
  calibrate_voltage(SOC_GPIO_PIN_BATTERY);
#elif defined(CONFIG_IDF_TARGET_ESP32C6)  || \
      defined(CONFIG_IDF_TARGET_ESP32C61) || \
      defined(CONFIG_IDF_TARGET_ESP32H2)
  /* TBD */
#else
#error "This ESP32 family build variant is not supported!"
#endif /* CONFIG_IDF_TARGET_ESP32C5 */
#endif /* ESP_IDF_VERSION_MAJOR */
}

