lyusupov/SoftRF/software/firmware/source/SkyView/Platform_ESP32.cpp
static float ESP32_Battery_voltage()
{
#if defined(CONFIG_IDF_TARGET_ESP32S3)
  if (ESP32_has_CPM) {
    float shuntvoltage = ina219.getShuntVoltage_mV();
    float busvoltage   = ina219.getBusVoltage_V();

    return (busvoltage + (shuntvoltage / 1000));
  }
#endif /* CONFIG_IDF_TARGET_ESP32S3 */

#if defined(CONFIG_IDF_TARGET_ESP32P4)
  if (ESP32_has_CPM) {
    float voltage = 0;

    if (bq_27220.refresh()) {
      BatteryStatus batteryStatus = bq_27220.getBatteryStatus();
      if (batteryStatus.isBatteryPresent()) {
        voltage = bq_27220.getVoltage();
      }
    }

    return voltage * 0.001;
  }
#endif /* CONFIG_IDF_TARGET_ESP32P4 */

  float voltage = ((float) read_voltage()) * 0.001 ;

  /* T5 has voltage divider 100k/100k on board */
  return (settings->adapter == ADAPTER_TTGO_T5S    ||
          settings->adapter == ADAPTER_TTGO_T5_4_7 ?
          2 * voltage : voltage);
}

#include <SoftSPI.h>
SoftSPI swSPI(SOC_GPIO_PIN_MOSI_WS,
              SOC_GPIO_PIN_MOSI_WS, /* half duplex */
              SOC_GPIO_PIN_SCK_WS);

#if defined(ESP_IDF_VERSION_MAJOR) && ESP_IDF_VERSION_MAJOR>=5
static spinlock_t EPD_ident_mutex;
#else
static portMUX_TYPE EPD_ident_mutex;
#endif /* ESP_IDF_VERSION_MAJOR */

static ep_model_id ESP32_EPD_ident()
{
  ep_model_id rval = EP_GDEW027W3; /* default */

#if defined(ESP_IDF_VERSION_MAJOR) && ESP_IDF_VERSION_MAJOR>=5
  spinlock_initialize(&EPD_ident_mutex);
#else
  vPortCPUInitializeMutex(&EPD_ident_mutex);
#endif /* ESP_IDF_VERSION_MAJOR */

  digitalWrite(SOC_GPIO_PIN_SS_WS, HIGH);
  pinMode(SOC_GPIO_PIN_SS_WS, OUTPUT);
  digitalWrite(SOC_EPD_PIN_DC_WS, HIGH);
  pinMode(SOC_EPD_PIN_DC_WS, OUTPUT);

  digitalWrite(SOC_EPD_PIN_RST_WS, LOW);
  pinMode(SOC_EPD_PIN_RST_WS, OUTPUT);
  delay(20);
  pinMode(SOC_EPD_PIN_RST_WS, INPUT_PULLUP);
  delay(200);
  pinMode(SOC_EPD_PIN_BUSY_WS, INPUT);

  swSPI.begin();

  uint8_t buf_2D[11];
  uint8_t buf_2E[10];

  taskENTER_CRITICAL(&EPD_ident_mutex);

  digitalWrite(SOC_EPD_PIN_DC_WS,  LOW);
  digitalWrite(SOC_GPIO_PIN_SS_WS, LOW);

  swSPI.transfer_out(0x2D);

  pinMode(SOC_GPIO_PIN_MOSI_WS, INPUT);
  digitalWrite(SOC_EPD_PIN_DC_WS, HIGH);

  for (int i=0; i<sizeof(buf_2D); i++) {
    buf_2D[i] = swSPI.transfer_in();
  }

  digitalWrite(SOC_GPIO_PIN_SCK_WS, LOW);
  digitalWrite(SOC_EPD_PIN_DC_WS,  LOW);
  digitalWrite(SOC_GPIO_PIN_SS_WS,  HIGH);

  taskEXIT_CRITICAL(&EPD_ident_mutex);

  delay(1);

  taskENTER_CRITICAL(&EPD_ident_mutex);

  digitalWrite(SOC_EPD_PIN_DC_WS,  LOW);
  digitalWrite(SOC_GPIO_PIN_SS_WS, LOW);

  swSPI.transfer_out(0x2E);

  pinMode(SOC_GPIO_PIN_MOSI_WS, INPUT);
  digitalWrite(SOC_EPD_PIN_DC_WS, HIGH);

  for (int i=0; i<sizeof(buf_2E); i++) {
    buf_2E[i] = swSPI.transfer_in();
  }

  digitalWrite(SOC_GPIO_PIN_SCK_WS, LOW);
  digitalWrite(SOC_EPD_PIN_DC_WS,  LOW);
  digitalWrite(SOC_GPIO_PIN_SS_WS,  HIGH);

  taskEXIT_CRITICAL(&EPD_ident_mutex);

  swSPI.end();

#if 0
  Serial.println();

  Serial.print("2D: ");
  for (int i=0; i<sizeof(buf_2D); i++) {
    Serial.print(buf_2D[i], HEX);
    Serial.print(' ');
  }
  Serial.println();

  Serial.print("2E: ");
  for (int i=0; i<sizeof(buf_2E); i++) {
    Serial.print(buf_2E[i], HEX);
    Serial.print(' ');
  }
  Serial.println();

/*
 *  0x2D:
 *  FF FF FF FF FF FF FF FF FF FF FF - W3
 *  00 00 00 FF 00 00 40 01 00 00 00
 *  00 00 40 20 10 00 40 01 00 00 00 - T91
 *
 *  0x2E:
 *  FF FF FF FF FF FF FF FF FF FF    - W3
 *  FF FF FF FF FF FF FF FF FF FF
 *  FF FF FF FF FF FF FF FF FF FF    - T91
 */
#endif

  bool is_ff = true;
  for (int i=0; i<sizeof(buf_2D); i++) {
    if (buf_2D[i] != 0xFF) {is_ff = false; break;}
  }

  bool is_00 = true;
  for (int i=0; i<sizeof(buf_2D); i++) {
    if (buf_2D[i] != 0x00) {is_00 = false; break;}
  }

  if (is_ff || is_00) {
    rval = EP_GDEW027W3;
  } else {
    rval = EP_GDEY027T91;
  }

  return rval;
}

#define EPD_STACK_SZ      (256*6)
static TaskHandle_t EPD_Task_Handle = NULL;

static ep_model_id ESP32_display = EP_UNKNOWN;

#if defined(USE_TFT)

#include <esp_display_panel.hpp>

using namespace esp_panel::drivers;
using namespace esp_panel::board;

extern Board *panel;

#undef _TO_STR
#undef TO_STR
#define _TO_STR(name) #name
#define TO_STR(name) _TO_STR(name)

extern "C" esp_err_t set_rm69a10_brightness(esp_lcd_panel_t *panel, uint8_t brightness);

#define ESP_PANEL_BOARD_BACKLIGHT_CUSTOM_FUNCTION(percent, user_data)  \
{  \
    auto board = static_cast<Board *>(user_data); \
    auto lcd = board->getLCD(); \
    esp_lcd_panel_t *panel = lcd->getRefreshPanelHandle() ;  \
    set_rm69a10_brightness(panel, static_cast<uint8_t>(static_cast<float>(percent) * 2.55)); \
    return true; \
}

const BoardConfig Board_Config_WTP4C5MP07S = {
    .name = "WTP4C5MP07S",

    .lcd = BoardConfig::LCD_Config{

        .bus_config = BusDSI::Config{
            .host = BusDSI::HostPartialConfig{
                .num_data_lanes = 2,
                .lane_bit_rate_mbps = 1000,
            },
            .refresh_panel = BusDSI::RefreshPanelPartialConfig{
                .dpi_clock_freq_mhz = 52,
                .bits_per_pixel = ESP_PANEL_LCD_COLOR_BITS_RGB565,
                .h_size = 1024,
                .v_size = 600,
                .hsync_pulse_width = 10,
                .hsync_back_porch = 160,
                .hsync_front_porch = 160,
                .vsync_pulse_width = 1,
                .vsync_back_porch = 23,
                .vsync_front_porch = 12,
            },
            .phy_ldo = BusDSI::PHY_LDO_PartialConfig{
                .chan_id = 3
            },
        },
        .device_name = TO_STR(EK79007),
        .device_config = {
            .device = LCD::DevicePartialConfig{
                .reset_gpio_num = SOC_GPIO_PIN_LCD_RST,
                .rgb_ele_order = 0,
                .bits_per_pixel = ESP_PANEL_LCD_COLOR_BITS_RGB565,
                .flags_reset_active_high = 1,
            },
            .vendor = LCD::VendorPartialConfig{
                .hor_res = 1024,
                .ver_res = 600,
            },
        },
        .pre_process = {
            .invert_color = 0,
        },
    },
#if defined(USE_EDPLIB_TOUCH)
    .touch = BoardConfig::TouchConfig{
        .bus_config = BusI2C::Config{
            .host_id = 0,
            .host = BusI2C::HostPartialConfig{
                .sda_io_num = SOC_GPIO_PIN_SDA,
                .scl_io_num = SOC_GPIO_PIN_SCL,
                .sda_pullup_en = 0,
                .scl_pullup_en = 0,
                .clk_speed = 400 * 1000,
            },
            .control_panel = BusI2C::ControlPanelFullConfig
                ESP_PANEL_TOUCH_I2C_CONTROL_PANEL_CONFIG_WITH_ADDR(GT911, 0x5D),
        },
        .device_name = TO_STR(GT911),
        .device_config = {
            .device = Touch::DevicePartialConfig{
                .x_max = 1024,
                .y_max = 600,
                .rst_gpio_num = -1, // SOC_GPIO_PIN_TP_RST
                .int_gpio_num = SOC_GPIO_PIN_TP_INT,
                .levels_reset = 1,
                .levels_interrupt = 0,
            },
        },
        .pre_process = {
            .swap_xy = 0,
            .mirror_x = 1,
            .mirror_y = 1,
        },
    },
#endif /* USE_EDPLIB_TOUCH */
    .backlight = BoardConfig::BacklightConfig{
        .config = BacklightSwitchGPIO::Config{
            .io_num = SOC_GPIO_PIN_LCD_BLED,
            .on_level = 1,
        },
        .pre_process = {
            .idle_off = 0,
        },
    },

