lyusupov/SoftRF/software/firmware/source/SkyView/Platform_ESP32.cpp
    .stage_callbacks = {
        nullptr,
        nullptr,
        nullptr,
        nullptr,
        nullptr,
        nullptr,
        nullptr,
        nullptr,
        nullptr,
        nullptr,
        nullptr,
        nullptr,
    },
};

const BoardConfig Board_Config_LilyGO_TDP4_TFT = {
    .name = "T-DISPLAY-P4-TFT",

    .lcd = BoardConfig::LCD_Config{

        .bus_config = BusDSI::Config{
            .host = BusDSI::HostPartialConfig{
                .num_data_lanes = 2,
                .lane_bit_rate_mbps = 1000,
            },
            .refresh_panel = BusDSI::RefreshPanelPartialConfig{
                .dpi_clock_freq_mhz = 60,
                .bits_per_pixel = ESP_PANEL_LCD_COLOR_BITS_RGB565,
                .h_size = 540,
                .v_size = 1168,
                .hsync_pulse_width = 28,
                .hsync_back_porch = 26,
                .hsync_front_porch = 20,
                .vsync_pulse_width = 2,
                .vsync_back_porch = 22,
                .vsync_front_porch = 200,
            },
            .phy_ldo = BusDSI::PHY_LDO_PartialConfig{
                .chan_id = 3
            },
        },
        .device_name = TO_STR(HI8561),
        .device_config = {
            .device = LCD::DevicePartialConfig{
                .reset_gpio_num = -1, /* XL 2 */
                .rgb_ele_order = 0,
                .bits_per_pixel = ESP_PANEL_LCD_COLOR_BITS_RGB565,
                .flags_reset_active_high = 0,
            },
            .vendor = LCD::VendorPartialConfig{
                .hor_res = 540,
                .ver_res = 1168,
            },
        },
        .pre_process = {
            .invert_color = 0,
        },
    },
#if defined(USE_EDPLIB_TOUCH)
    .touch = BoardConfig::TouchConfig{
        .bus_config = BusI2C::Config{
            .host_id = 0,
            .host = BusI2C::HostPartialConfig{
                .sda_io_num = SOC_GPIO_PIN_SDA,
                .scl_io_num = SOC_GPIO_PIN_SCL,
                .sda_pullup_en = 0,
                .scl_pullup_en = 0,
                .clk_speed = 400 * 1000,
            },
            .control_panel = BusI2C::ControlPanelFullConfig
                ESP_PANEL_TOUCH_I2C_CONTROL_PANEL_CONFIG(GT911), /* HI8561 */
        },
        .device_name = TO_STR(GT911),/* HI8561 */
        .device_config = {
            .device = Touch::DevicePartialConfig{
                .x_max = 540,
                .y_max = 1168,
                .rst_gpio_num = -1, /* XL 3 */
                .int_gpio_num = -1, /* XL 4 */
                .levels_reset = 0,
                .levels_interrupt = 0,
            },
        },
        .pre_process = {
            .swap_xy = 0,
            .mirror_x = 1,
            .mirror_y = 1,
        },
    },
#endif /* USE_EDPLIB_TOUCH */
    .backlight = BoardConfig::BacklightConfig{
        .config = BacklightSwitchGPIO::Config{
            .io_num = SOC_GPIO_PIN_TDP4_BL,
            .on_level = 1,
        },
        .pre_process = {
            .idle_off = 0,
        },
    },

    .stage_callbacks = {
        nullptr,
        nullptr,
        nullptr,
        nullptr,
        nullptr,
        nullptr,
        nullptr,
        nullptr,
        nullptr,
        nullptr,
        nullptr,
        nullptr,
    },
};

const BoardConfig Board_Config_LilyGO_TDP4_AMOLED = {
    .name = "T-DISPLAY-P4-AMOLED",

    .lcd = BoardConfig::LCD_Config{

        .bus_config = BusDSI::Config{
            .host = BusDSI::HostPartialConfig{
                .num_data_lanes = 2,
                .lane_bit_rate_mbps = 1000,
            },
            .refresh_panel = BusDSI::RefreshPanelPartialConfig{
                .dpi_clock_freq_mhz = 60,
                .bits_per_pixel = ESP_PANEL_LCD_COLOR_BITS_RGB565,
                .h_size = 568,
                .v_size = 1232,
                .hsync_pulse_width = 50,
                .hsync_back_porch = 150,
                .hsync_front_porch = 50,
                .vsync_pulse_width = 40,
                .vsync_back_porch = 120,
                .vsync_front_porch = 80,
            },
            .phy_ldo = BusDSI::PHY_LDO_PartialConfig{
                .chan_id = 3
            },
        },
        .device_name = TO_STR(RM69A10),
        .device_config = {
            .device = LCD::DevicePartialConfig{
                .reset_gpio_num = -1, /* XL 2 */
                .rgb_ele_order = 0,
                .bits_per_pixel = ESP_PANEL_LCD_COLOR_BITS_RGB565,
                .flags_reset_active_high = 0,
            },
            .vendor = LCD::VendorPartialConfig{
                .hor_res = 568,
                .ver_res = 1232,
            },
        },
        .pre_process = {
            .invert_color = 0,
        },
    },
#if defined(USE_EDPLIB_TOUCH)
    .touch = BoardConfig::TouchConfig{
        .bus_config = BusI2C::Config{
            .host_id = 0,
            .host = BusI2C::HostPartialConfig{
                .sda_io_num = SOC_GPIO_PIN_SDA,
                .scl_io_num = SOC_GPIO_PIN_SCL,
                .sda_pullup_en = 0,
                .scl_pullup_en = 0,
                .clk_speed = 400 * 1000,
            },
            .control_panel = BusI2C::ControlPanelFullConfig
                ESP_PANEL_TOUCH_I2C_CONTROL_PANEL_CONFIG(GT911), /* GT9895 */
        },
        .device_name = TO_STR(GT911), /* GT9895 */
        .device_config = {
            .device = Touch::DevicePartialConfig{
                .x_max = 568,
                .y_max = 1232,
                .rst_gpio_num = -1, /* XL 3 */
                .int_gpio_num = -1, /* XL 4 */
                .levels_reset = 0,
                .levels_interrupt = 0,
            },
        },
        .pre_process = {
            .swap_xy = 0,
            .mirror_x = 1,
            .mirror_y = 1,
        },
    },
#endif /* USE_EDPLIB_TOUCH */
    .backlight = BoardConfig::BacklightConfig{
        .config = BacklightCustom::Config{
            .callback = [](int percent, void *user_data)
                ESP_PANEL_BOARD_BACKLIGHT_CUSTOM_FUNCTION(percent, user_data),
            .user_data = nullptr,
        },
        .pre_process = {
            .idle_off = 0,
        },
    },

