lyusupov/SoftRF/software/firmware/source/SkyView/Platform_ESP32.cpp
    .stage_callbacks = {
        nullptr,
        nullptr,
        nullptr,
        nullptr,
        nullptr,
        nullptr,
        nullptr,
        nullptr,
        nullptr,
        nullptr,
        nullptr,
        nullptr,
    },
};
#endif /* USE_TFT */

static byte ESP32_Display_setup(bool splash_screen)
{
  switch(settings->adapter)
  {
  case ADAPTER_WAVESHARE_ESP32:
  case ADAPTER_WAVESHARE_PICO_2_7:
#if defined(CONFIG_IDF_TARGET_ESP32P4)
  case ADAPTER_WAVESHARE_PI_HAT_2_7:
#endif /* CONFIG_IDF_TARGET_ESP32P4 */
    if (ESP32_display == EP_UNKNOWN) {
      ESP32_display = ESP32_EPD_ident();
    }

    switch (ESP32_display)
    {
    case EP_GDEY027T91:
      display = &epd_waveshare_T91;
      break;
    case EP_GDEW027W3:
    default:
      display = &epd_waveshare_W3;
      break;
    }

    display->epd2.selectSPI(SPI, SPISettings(4000000, MSBFIRST, SPI_MODE0));
    SPI.begin(SOC_GPIO_PIN_SCK_WS,
              SOC_GPIO_PIN_MISO_WS,
              SOC_GPIO_PIN_MOSI_WS,
              SOC_GPIO_PIN_SS_WS);
    break;
  case ADAPTER_WAVESHARE_PICO_2_7_V2:
#if defined(CONFIG_IDF_TARGET_ESP32P4)
  case ADAPTER_WAVESHARE_PI_HAT_2_7_V2:
#endif /* CONFIG_IDF_TARGET_ESP32P4 */
    display = &epd_waveshare_T91;
    display->epd2.selectSPI(SPI, SPISettings(4000000, MSBFIRST, SPI_MODE0));
    SPI.begin(SOC_GPIO_PIN_SCK_WS,
              SOC_GPIO_PIN_MISO_WS,
              SOC_GPIO_PIN_MOSI_WS,
              SOC_GPIO_PIN_SS_WS);
    break;
#if defined(BUILD_SKYVIEW_HD)
  case ADAPTER_TTGO_T5_4_7:
    display = NULL;
    break;
#endif /* BUILD_SKYVIEW_HD */
#if defined(CONFIG_IDF_TARGET_ESP32P4)
  case ADAPTER_MIPI_DSI:
    display = NULL;
    break;
#endif /* CONFIG_IDF_TARGET_ESP32P4 */
  case ADAPTER_TTGO_T5S:
  default:
    display = &epd_ttgo_t5s_W3;
    display->epd2.selectSPI(SPI, SPISettings(4000000, MSBFIRST, SPI_MODE0));

    SPI.begin(SOC_GPIO_PIN_SCK_T5S,
              SOC_GPIO_PIN_MISO_T5S,
              SOC_GPIO_PIN_MOSI_T5S,
              SOC_GPIO_PIN_SS_T5S);

#if defined(CONFIG_IDF_TARGET_ESP32)
    /* SD-SPI init */
    uSD_SPI.begin(SOC_SD_PIN_SCK_T5S,
                  SOC_SD_PIN_MISO_T5S,
                  SOC_SD_PIN_MOSI_T5S,
                  SOC_SD_PIN_SS_T5S);
#endif /* CONFIG_IDF_TARGET_ESP32 */
    break;
  }

  xTaskCreateUniversal(EPD_Task, "EPD update", EPD_STACK_SZ, NULL, 1,
                       &EPD_Task_Handle, CONFIG_ARDUINO_RUNNING_CORE);

  byte rval = EPD_setup(splash_screen);

#if defined(USE_TFT)
  if (rval == DISPLAY_NONE) {

    if( EPD_Task_Handle != NULL )
    {
      vTaskDelete( EPD_Task_Handle );
    }

    switch (hw_info.revision)
    {
    case HW_REV_TDISPLAY_P4_TFT:
      if (ESP32_has_gpio_extension) {
        xl9535->digitalWrite(ExtensionIOXL9555::SOC_EXPIO_TDP4_DSI_RST, LOW);
        delay(20);
        xl9535->digitalWrite(ExtensionIOXL9555::SOC_EXPIO_TDP4_DSI_RST, HIGH);
        delay(20);
      }
      panel = new Board(Board_Config_LilyGO_TDP4_TFT);
      break;
    case HW_REV_TDISPLAY_P4_AMOLED:
      if (ESP32_has_gpio_extension) {
        xl9535->digitalWrite(ExtensionIOXL9555::SOC_EXPIO_TDP4_DSI_RST, LOW);
        delay(20);
        xl9535->digitalWrite(ExtensionIOXL9555::SOC_EXPIO_TDP4_DSI_RST, HIGH);
        delay(20);
      }
      panel = new Board(Board_Config_LilyGO_TDP4_AMOLED);
      break;
    case HW_REV_DEVKIT:
    default:
      panel = new Board(Board_Config_WTP4C5MP07S);
      break;
    }

    panel->init();

#if LVGL_PORT_AVOID_TEARING_MODE
    auto lcd = panel->getLCD();
    lcd->configFrameBufferNumber(LVGL_PORT_DISP_BUFFER_NUM);
#endif

#if defined(USE_EDPLIB_TOUCH)
    static_cast<esp_panel::drivers::BusI2C *>(panel->getTouch()->getBus())->configI2C_HostSkipInit();
#endif /* USE_EDPLIB_TOUCH */
    assert(panel->begin());

    rval = TFT_setup();
  }
#endif /* USE_TFT */

  return rval;
}

static void ESP32_Display_loop()
{
  switch (hw_info.display)
  {
#if defined(USE_TFT)
  case DISPLAY_TFT_7_0:
  case DISPLAY_TFT_4_05:
  case DISPLAY_AMOLED_4_1:
    TFT_loop();
    break;
#endif /* USE_TFT */
  case DISPLAY_EPD_2_7:
    EPD_loop();
    break;
  case DISPLAY_NONE:
  default:
    break;
  }
}

static void ESP32_Display_fini(const char *msg, bool screen_saver)
{
  switch (hw_info.display)
  {
#if defined(USE_TFT)
  case DISPLAY_TFT_7_0:
  case DISPLAY_TFT_4_05:
  case DISPLAY_AMOLED_4_1:
    TFT_fini();
    break;
#endif /* USE_TFT */
  case DISPLAY_EPD_2_7:
    if( EPD_Task_Handle != NULL )
    {
      vTaskDelete( EPD_Task_Handle );
    }

    EPD_fini(msg, screen_saver);
    break;
  case DISPLAY_NONE:
  default:
    break;
  }
}

static bool ESP32_Display_is_ready()
{
  switch (hw_info.display)
  {
#if defined(USE_TFT)
  case DISPLAY_TFT_7_0:
  case DISPLAY_TFT_4_05:
  case DISPLAY_AMOLED_4_1:
    /* TBD */
    break;
#endif /* USE_TFT */
  case DISPLAY_EPD_2_7:
//    return true;
    return (EPD_task_command == EPD_UPDATE_NONE);
    break;
  case DISPLAY_NONE:
  default:
    break;
  }

  return true;
}

static void ESP32_Display_update(int val)
{
  switch (hw_info.display)
  {
#if defined(USE_TFT)
  case DISPLAY_TFT_7_0:
  case DISPLAY_TFT_4_05:
  case DISPLAY_AMOLED_4_1:
    /* TBD */
    break;
#endif /* USE_TFT */
  case DISPLAY_EPD_2_7:
//    EPD_Update_Sync(val);
    EPD_task_command = val;
    break;
  case DISPLAY_NONE:
  default:
    break;
  }
}

static size_t ESP32_WiFi_Receive_UDP(uint8_t *buf, size_t max_size)
{
  return WiFi_Receive_UDP(buf, max_size);
}

static int ESP32_WiFi_clients_count()
{
  WiFiMode_t mode = WiFi.getMode();

  switch (mode)
  {
  case WIFI_AP:
    wifi_sta_list_t stations;
    ESP_ERROR_CHECK(esp_wifi_ap_get_sta_list(&stations));

#if defined(ESP_IDF_VERSION_MAJOR) && ESP_IDF_VERSION_MAJOR>=5
    wifi_sta_mac_ip_list_t infoList;
    ESP_ERROR_CHECK(esp_wifi_ap_get_sta_list_with_ip(&stations, &infoList));
#else
    tcpip_adapter_sta_list_t infoList;
    ESP_ERROR_CHECK(tcpip_adapter_get_sta_list(&stations, &infoList));
#endif /* ESP_IDF_VERSION_MAJOR */
    return infoList.num;

  case WIFI_STA:
  default:
    return -1; /* error */
  }
}

static bool ESP32_DB_init()
{
  bool rval = false;

  switch (settings->adapter)
  {
#if defined(CONFIG_IDF_TARGET_ESP32) || defined(CONFIG_IDF_TARGET_ESP32P4)
  case ADAPTER_TTGO_T5S:
#if defined(CONFIG_IDF_TARGET_ESP32P4)
  case ADAPTER_WAVESHARE_PI_HAT_2_7:
  case ADAPTER_WAVESHARE_PI_HAT_2_7_V2:
#endif /* CONFIG_IDF_TARGET_ESP32P4 */
#if !defined(BUILD_SKYVIEW_HD)
    {
      sdcard_files_to_open += (settings->adb   == DB_FLN    ? 1 : 0);
      sdcard_files_to_open += (settings->adb   == DB_OGN    ? 1 : 0);
      sdcard_files_to_open += (settings->adb   == DB_ICAO   ? 1 : 0);
      sdcard_files_to_open += (settings->voice != VOICE_OFF ? 1 : 0);

