lyusupov/SoftRF/software/firmware/source/SkyView/Platform_ESP32.cpp
#if defined(CONFIG_IDF_TARGET_ESP32)
      int uSD_SS_pin = SOC_SD_PIN_SS_T5S;
#endif /* CONFIG_IDF_TARGET_ESP32 */
#if defined(CONFIG_IDF_TARGET_ESP32P4)
      int uSD_SS_pin = SOC_GPIO_PIN_SD_D3;
#endif /* CONFIG_IDF_TARGET_ESP32P4 */

      if (!SD.begin(uSD_SS_pin, uSD_SPI, 4000000, "/sd", sdcard_files_to_open)) {
        Serial.println(F("ERROR: Failed to mount microSD card."));
        return rval;
      }

      if (settings->adb == DB_NONE) {
        return rval;
      }

      sqlite3_initialize();

      if (settings->adb == DB_FLN) {
        sqlite3_open("/sd/Aircrafts/fln.db", &fln_db);

        if (fln_db == NULL)
        {
          Serial.println(F("Failed to open FlarmNet DB\n"));
        }  else {
          rval = true;
        }
      }

      if (settings->adb == DB_OGN) {
        sqlite3_open("/sd/Aircrafts/ogn.db", &ogn_db);

        if (ogn_db == NULL)
        {
          Serial.println(F("Failed to open OGN DB\n"));
        }  else {
          rval = true;
        }
      }

      if (settings->adb == DB_ICAO) {
        sqlite3_open("/sd/Aircrafts/icao.db", &icao_db);

        if (icao_db == NULL)
        {
          Serial.println(F("Failed to open ICAO DB\n"));
        }  else {
          rval = true;
        }
      }
    }
#endif /* BUILD_SKYVIEW_HD */
    break;
#endif /* CONFIG_IDF_TARGET_ESP32 */
#if defined(CONFIG_IDF_TARGET_ESP32S3)
  case ADAPTER_WAVESHARE_PICO_2_7:
  case ADAPTER_WAVESHARE_PICO_2_7_V2:
#if !defined(BUILD_SKYVIEW_HD)
    if (FATFS_is_mounted) {
      const char *fileName;

      if (settings->adb == DB_OGN) {
        fileName = "/Aircrafts/ogn.cdb";

        if (ucdb.open(fileName) != CDB_OK) {
          Serial.print("Invalid CDB: ");
          Serial.println(fileName);
        } else {
          ADB_is_open = true;
        }
      }
      if (settings->adb == DB_FLN) {
        fileName = "/Aircrafts/fln.cdb";

        if (ucdb.open(fileName) != CDB_OK) {
          Serial.print("Invalid CDB: ");
          Serial.println(fileName);
        } else {
          ADB_is_open = true;
        }
      }
    }

    rval = ADB_is_open;
#endif /* BUILD_SKYVIEW_HD */
    break;
#endif /* CONFIG_IDF_TARGET_ESP32S3 */
  default:
    break;
  }

  return rval;
}

static bool ESP32_DB_query(uint8_t type, uint32_t id, char *buf, size_t size)
{
  bool rval = false;

  switch (settings->adapter)
  {
#if defined(CONFIG_IDF_TARGET_ESP32) || defined(CONFIG_IDF_TARGET_ESP32P4)
  case ADAPTER_TTGO_T5S:
#if defined(CONFIG_IDF_TARGET_ESP32P4)
  case ADAPTER_WAVESHARE_PI_HAT_2_7:
  case ADAPTER_WAVESHARE_PI_HAT_2_7_V2:
#endif /* CONFIG_IDF_TARGET_ESP32P4 */
#if !defined(BUILD_SKYVIEW_HD)
    {
      sqlite3_stmt *stmt;
      char *query = NULL;
      int error;
      const char *reg_key, *db_key;
      sqlite3 *db;

      switch (type)
      {
      case DB_OGN:
        switch (settings->idpref)
        {
        case ID_TAIL:
          reg_key = "accn";
          break;
        case ID_MAM:
          reg_key = "acmodel";
          break;
        case ID_REG:
        default:
          reg_key = "acreg";
          break;
        }
        db_key  = "devices";
        db      = ogn_db;
        break;
      case DB_ICAO:
        switch (settings->idpref)
        {
        case ID_TAIL:
          reg_key = "owner";
          break;
        case ID_MAM:
          reg_key = "type";
          break;
        case ID_REG:
        default:
          reg_key = "registration";
          break;
        }
        db_key  = "aircrafts";
        db      = icao_db;
        break;
      case DB_FLN:
      default:
        switch (settings->idpref)
        {
        case ID_TAIL:
          reg_key = "tail";
          break;
        case ID_MAM:
          reg_key = "type";
          break;
        case ID_REG:
        default:
          reg_key = "registration";
          break;
        }
        db_key  = "aircrafts";
        db      = fln_db;
        break;
      }

      if (db == NULL) {
        return false;
      }

      error = asprintf(&query, "select %s from %s where id = %d",reg_key, db_key, id);

      if (error == -1) {
        return false;
      }

      sqlite3_prepare_v2(db, query, strlen(query), &stmt, NULL);

      while (sqlite3_step(stmt) != SQLITE_DONE) {
        if (sqlite3_column_type(stmt, 0) == SQLITE3_TEXT) {

          size_t len = strlen((char *) sqlite3_column_text(stmt, 0));

          if (len > 0) {
            len = len > size ? size : len;
            strncpy(buf, (char *) sqlite3_column_text(stmt, 0), len);
            if (len < size) {
              buf[len] = 0;
            } else if (len == size) {
              buf[len-1] = 0;
            }
            rval = true;
          }
        }
      }

      sqlite3_finalize(stmt);

      free(query);
    }
#endif /* BUILD_SKYVIEW_HD */
    break;
#endif /* CONFIG_IDF_TARGET_ESP32 */
#if defined(CONFIG_IDF_TARGET_ESP32S3)
  case ADAPTER_WAVESHARE_PICO_2_7:
  case ADAPTER_WAVESHARE_PICO_2_7_V2:
#if !defined(BUILD_SKYVIEW_HD)
    {
      char key[8];
      char out[64];
      uint8_t tokens[3] = { 0 };
      cdbResult rt;
      int c, i = 0, token_cnt = 0;
      int tok_num = 1;

      if (!ADB_is_open) {
        return rval;
      }

      snprintf(key, sizeof(key),"%06X", id);

      rt = ucdb.findKey(key, strlen(key));

      switch (rt) {
        case KEY_FOUND:
          while ((c = ucdb.readValue()) != -1 && i < (sizeof(out) - 1)) {
            if (c == '|') {
              if (token_cnt < (sizeof(tokens) - 1)) {
                token_cnt++;
                tokens[token_cnt] = i+1;
              }
              c = 0;
            }
            out[i++] = (char) c;
          }
          out[i] = 0;

          switch (settings->idpref)
          {
          case ID_TAIL:
            tok_num = 2;
            break;
          case ID_MAM:
            tok_num = 0;
            break;
          case ID_REG:
          default:
            tok_num = 1;
            break;
          }

          if (strlen(out + tokens[tok_num]) > 0) {
            snprintf(buf, size, "%s", out + tokens[tok_num]);
            rval = true;
          }
          break;

        case KEY_NOT_FOUND:
        default:
          break;
      }
    }
#endif /* BUILD_SKYVIEW_HD */
    break;
#endif /* CONFIG_IDF_TARGET_ESP32S3 */
  default:
    break;
  }

  return rval;
}

static void ESP32_DB_fini()
{
  switch (settings->adapter)
  {
#if defined(CONFIG_IDF_TARGET_ESP32) || defined(CONFIG_IDF_TARGET_ESP32P4)
  case ADAPTER_TTGO_T5S:
#if defined(CONFIG_IDF_TARGET_ESP32P4)
  case ADAPTER_WAVESHARE_PI_HAT_2_7:
  case ADAPTER_WAVESHARE_PI_HAT_2_7_V2:
#endif /* CONFIG_IDF_TARGET_ESP32P4 */
#if !defined(BUILD_SKYVIEW_HD)
    if (settings->adb != DB_NONE) {
      if (fln_db != NULL) {
        sqlite3_close(fln_db);
      }

      if (ogn_db != NULL) {
        sqlite3_close(ogn_db);
      }

