lyusupov/SoftRF/software/firmware/source/SkyView/Platform_ESP32.cpp
      if (icao_db != NULL) {
        sqlite3_close(icao_db);
      }

      sqlite3_shutdown();
    }

    SD.end();
#endif /* BUILD_SKYVIEW_HD */
    break;
#endif /* CONFIG_IDF_TARGET_ESP32 */
#if defined(CONFIG_IDF_TARGET_ESP32S3)
  case ADAPTER_WAVESHARE_PICO_2_7:
  case ADAPTER_WAVESHARE_PICO_2_7_V2:
#if !defined(BUILD_SKYVIEW_HD)
    if (ADB_is_open) {
      ucdb.close();
      ADB_is_open = false;
    }
#endif /* BUILD_SKYVIEW_HD */
    break;
#endif /* CONFIG_IDF_TARGET_ESP32S3 */
  default:
    break;
  }
}

#if defined(CONFIG_IDF_TARGET_ESP32)   || \
    defined(CONFIG_IDF_TARGET_ESP32S2) || \
    defined(CONFIG_IDF_TARGET_ESP32C3) || \
    defined(CONFIG_IDF_TARGET_ESP32C5) || \
    defined(CONFIG_IDF_TARGET_ESP32C6) || \
    defined(CONFIG_IDF_TARGET_ESP32P4)
/* write sample data to I2S */
int i2s_write_sample_nb(uint32_t sample)
{
#if defined(ESP_IDF_VERSION_MAJOR) && ESP_IDF_VERSION_MAJOR>=4
  size_t i2s_bytes_written;
  i2s_write((i2s_port_t)i2s_num, (const char*)&sample, sizeof(uint32_t),
             &i2s_bytes_written, 100);
  return i2s_bytes_written;
#else
  return i2s_write_bytes((i2s_port_t)i2s_num, (const char *)&sample,
                          sizeof(uint32_t), 100);
#endif
}

/* read 4 bytes of data from wav file */
int read4bytes(File file, uint32_t *chunkId)
{
  int n = file.read((uint8_t *)chunkId, sizeof(uint32_t));
  return n;
}

/* these are functions to process wav file */
int readRiff(File file, wavRiff_t *wavRiff)
{
  int n = file.read((uint8_t *)wavRiff, sizeof(wavRiff_t));
  return n;
}
int readProps(File file, wavProperties_t *wavProps)
{
  int n = file.read((uint8_t *)wavProps, sizeof(wavProperties_t));
  return n;
}

static bool play_file(char *filename)
{
  bool rval = false;

#if !defined(EXCLUDE_AUDIO)
  headerState_t state = HEADER_RIFF;

#if 1
  File wavfile = SD.open(filename);
#else
  File wavfile = fatfs.open(filename, FILE_READ);
#endif

  if (wavfile) {
    int c = 0;
    int n;
    while (wavfile.available()) {
      switch(state){
        case HEADER_RIFF:
        wavRiff_t wavRiff;
        n = readRiff(wavfile, &wavRiff);
        if(n == sizeof(wavRiff_t)){
          if(wavRiff.chunkID == CCCC('R', 'I', 'F', 'F') && wavRiff.format == CCCC('W', 'A', 'V', 'E')){
            state = HEADER_FMT;
//            Serial.println("HEADER_RIFF");
          }
        }
        break;
        case HEADER_FMT:
        n = readProps(wavfile, &wavProps);
        if(n == sizeof(wavProperties_t)){
          state = HEADER_DATA;
#if 0
            Serial.print("chunkID = "); Serial.println(wavProps.chunkID);
            Serial.print("chunkSize = "); Serial.println(wavProps.chunkSize);
            Serial.print("audioFormat = "); Serial.println(wavProps.audioFormat);
            Serial.print("numChannels = "); Serial.println(wavProps.numChannels);
            Serial.print("sampleRate = "); Serial.println(wavProps.sampleRate);
            Serial.print("byteRate = "); Serial.println(wavProps.byteRate);
            Serial.print("blockAlign = "); Serial.println(wavProps.blockAlign);
            Serial.print("bitsPerSample = "); Serial.println(wavProps.bitsPerSample);
#endif
        }
        break;
        case HEADER_DATA:
        uint32_t chunkId, chunkSize;
        n = read4bytes(wavfile, &chunkId);
        if(n == 4){
          if(chunkId == CCCC('d', 'a', 't', 'a')){
//            Serial.println("HEADER_DATA");
          }
        }
        n = read4bytes(wavfile, &chunkSize);
        if(n == 4){
//          Serial.println("prepare data");
          state = DATA;
        }
        //initialize i2s with configurations above
        i2s_driver_install((i2s_port_t)i2s_num, &i2s_config, 0, NULL);
        i2s_set_pin((i2s_port_t)i2s_num, &pin_config);
        //set sample rates of i2s to sample rate of wav file
        i2s_set_sample_rates((i2s_port_t)i2s_num, wavProps.sampleRate);
        break;
        /* after processing wav file, it is time to process music data */
        case DATA:
        uint32_t data;
        n = read4bytes(wavfile, &data);
        i2s_write_sample_nb(data);
        break;
      }
    }
    wavfile.close();
    rval = true;
  } else {
    Serial.println(F("error opening WAV file"));
  }
  if (state == DATA) {
    i2s_driver_uninstall((i2s_port_t)i2s_num); //stop & destroy i2s driver
  }
#endif /* EXCLUDE_AUDIO */

  return rval;
}
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
static bool play_file(char *filename)
{
  bool rval = false;

#if !defined(EXCLUDE_AUDIO)
  if (Audio_Source->open(filename)) {
    unsigned long Audio_Timemarker = millis();
    Audio_Gen->begin(Audio_Source, Audio_Sink);

    while (Audio_Gen->loop()) {
      if (millis() - Audio_Timemarker > 10000) {
        Audio_Gen->stop();
        Serial.println("ERROR: Audio timeout. Playback aborted.");
        Serial.flush();
      }
    }

    rval = true;
  }
#endif /* EXCLUDE_AUDIO */

  return rval;
}
#else
#error "This ESP32 family build variant is not supported!"
#endif /* CONFIG_IDF_TARGET_ESP32XX */


static void ESP32_TTS(char *message)
{
  char filename[MAX_FILENAME_LEN];

  if (strcmp(message, "POST")) {
    if ( settings->voice   != VOICE_OFF                       &&
        (settings->adapter == ADAPTER_TTGO_T5S                ||
#if defined(CONFIG_IDF_TARGET_ESP32P4)
         settings->adapter == ADAPTER_WAVESHARE_PI_HAT_2_7    ||
         settings->adapter == ADAPTER_WAVESHARE_PI_HAT_2_7_V2 ||
#endif /* CONFIG_IDF_TARGET_ESP32P4 */
         settings->adapter == ADAPTER_WAVESHARE_PICO_2_7      ||
         settings->adapter == ADAPTER_WAVESHARE_PICO_2_7_V2)) {

#if defined(CONFIG_IDF_TARGET_ESP32)   || \
    defined(CONFIG_IDF_TARGET_ESP32S2) || \
    defined(CONFIG_IDF_TARGET_ESP32C3) || \
    defined(CONFIG_IDF_TARGET_ESP32C5) || \
    defined(CONFIG_IDF_TARGET_ESP32C6) || \
    defined(CONFIG_IDF_TARGET_ESP32P4)
      if (SD.cardType() == CARD_NONE)
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
      if (!FATFS_is_mounted)
#else
#error "This ESP32 family build variant is not supported!"
#endif /* CONFIG_IDF_TARGET_ESP32XX */
        return;

      if (hw_info.display == DISPLAY_EPD_2_7) {
        while (!SoC->Display_is_ready()) {yield();}
        EPD_Message("VOICE", "ALERT");
        SoC->Display_update(EPD_UPDATE_FAST);
        while (!SoC->Display_is_ready()) {yield();}
      }

      bool wdt_status = loopTaskWDTEnabled;

      if (wdt_status) {
        disableLoopWDT();
      }

      char *word = strtok (message, " ");

      while (word != NULL)
      {
          strcpy(filename, WAV_FILE_PREFIX);
          strcat(filename,  settings->voice == VOICE_1 ? VOICE1_SUBDIR :
                           (settings->voice == VOICE_2 ? VOICE2_SUBDIR :
                           (settings->voice == VOICE_3 ? VOICE3_SUBDIR :
                            "" )));
          strcat(filename, word);
          strcat(filename, WAV_FILE_SUFFIX);
          play_file(filename);
          word = strtok (NULL, " ");

          yield();

          /* Poll input source(s) */
          Input_loop();
      }

      if (wdt_status) {
        enableLoopWDT();
      }
    }
  } else {
    if ( settings->voice   != VOICE_OFF                       &&
        (settings->adapter == ADAPTER_TTGO_T5S                ||
#if defined(CONFIG_IDF_TARGET_ESP32P4)
         settings->adapter == ADAPTER_WAVESHARE_PI_HAT_2_7    ||
         settings->adapter == ADAPTER_WAVESHARE_PI_HAT_2_7_V2 ||
#endif /* CONFIG_IDF_TARGET_ESP32P4 */
         settings->adapter == ADAPTER_WAVESHARE_PICO_2_7      ||
         settings->adapter == ADAPTER_WAVESHARE_PICO_2_7_V2)) {

      strcpy(filename, WAV_FILE_PREFIX);
      strcat(filename, "POST");
      strcat(filename, WAV_FILE_SUFFIX);

