lyusupov/SoftRF/software/firmware/source/SkyView/Platform_ESP32.cpp
#if defined(CONFIG_IDF_TARGET_ESP32)   || \
    defined(CONFIG_IDF_TARGET_ESP32S2) || \
    defined(CONFIG_IDF_TARGET_ESP32C3) || \
    defined(CONFIG_IDF_TARGET_ESP32C5) || \
    defined(CONFIG_IDF_TARGET_ESP32C6) || \
    defined(CONFIG_IDF_TARGET_ESP32P4)
      if (SD.cardType() == CARD_NONE ||
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
      if (!FATFS_is_mounted          ||
#else
#error "This ESP32 family build variant is not supported!"
#endif /* CONFIG_IDF_TARGET_ESP32XX */
          !play_file(filename)) {
        /* keep boot-time SkyView logo on the screen for 7 seconds */
        delay(7000);
      }
    } else {
      if (hw_info.display == DISPLAY_EPD_2_7) {
        /* keep boot-time SkyView logo on the screen for 7 seconds */
        delay(7000);
      }
    }
  }
}

#include <AceButton.h>
using namespace ace_button;

AceButton button_mode(SOC_BUTTON_MODE_T5S);
AceButton button_up  (SOC_BUTTON_UP_T5S);
AceButton button_down(SOC_BUTTON_DOWN_T5S);

// The event handler for the button.
void handleEvent(AceButton* button, uint8_t eventType,
    uint8_t buttonState) {

#if 0
  // Print out a message for all events.
  if        (button == &button_mode) {
    Serial.print(F("MODE "));
  } else if (button == &button_up) {
    Serial.print(F("UP   "));
  } else if (button == &button_down) {
    Serial.print(F("DOWN "));
  }

  Serial.print(F("handleEvent(): eventType: "));
  Serial.print(eventType);
  Serial.print(F("; buttonState: "));
  Serial.println(buttonState);
#endif

  switch (eventType) {
    case AceButton::kEventPressed:
      break;
    case AceButton::kEventReleased:
      if (button == &button_mode) {
        EPD_Mode();
      } else if (button == &button_up) {
        EPD_Up();
      } else if (button == &button_down) {
        EPD_Down();
      }
      break;
    case AceButton::kEventLongPressed:
      if (button == &button_mode) {

        if (settings->adapter == ADAPTER_TTGO_T5S &&
            digitalRead(SOC_BUTTON_DOWN_T5S) == LOW) {
          screen_saver = true;
        }

#if defined(CONFIG_IDF_TARGET_ESP32S3)
        if ((settings->adapter == ADAPTER_WAVESHARE_PICO_2_7     ||
             settings->adapter == ADAPTER_WAVESHARE_PICO_2_7_V2) &&
            digitalRead(SOC_GPIO_PIN_KEY2) == LOW) {
          screen_saver = true;
        }
#endif /* CONFIG_IDF_TARGET_ESP32S3 */

        shutdown("NORMAL OFF");
        Serial.println(F("This will never be printed."));
      }
      break;
  }
}

/* Callbacks for push button interrupt */
void onModeButtonEvent() {
  button_mode.check();
}

void onUpButtonEvent() {
  button_up.check();
}

void onDownButtonEvent() {
  button_down.check();
}

static void ESP32_Button_setup()
{
  int mode_button_pin = SOC_BUTTON_MODE_DEF;

#if defined(CONFIG_IDF_TARGET_ESP32)
  if (settings->adapter == ADAPTER_TTGO_T5S) {
    mode_button_pin = SOC_BUTTON_MODE_T5S;
  }
#endif /* CONFIG_IDF_TARGET_ESP32 */

#if defined(CONFIG_IDF_TARGET_ESP32S3)
  if (settings->adapter == ADAPTER_WAVESHARE_PICO_2_7 ||
      settings->adapter == ADAPTER_WAVESHARE_PICO_2_7_V2) {
    mode_button_pin = SOC_GPIO_PIN_KEY1;
  }
#endif /* CONFIG_IDF_TARGET_ESP32S3 */

#if defined(CONFIG_IDF_TARGET_ESP32P4)
  if (settings->adapter == ADAPTER_WAVESHARE_PI_HAT_2_7 ||
      settings->adapter == ADAPTER_WAVESHARE_PI_HAT_2_7_V2) {
    mode_button_pin = SOC_GPIO_BUTTON_MODE;
  }
#endif /* CONFIG_IDF_TARGET_ESP32P4 */

  pinMode(mode_button_pin, settings->adapter == ADAPTER_WAVESHARE_PICO_2_7      ||
#if defined(CONFIG_IDF_TARGET_ESP32P4)
                           settings->adapter == ADAPTER_WAVESHARE_PI_HAT_2_7    ||
                           settings->adapter == ADAPTER_WAVESHARE_PI_HAT_2_7_V2 ||
#endif /* CONFIG_IDF_TARGET_ESP32P4 */
                           settings->adapter == ADAPTER_WAVESHARE_PICO_2_7_V2   ?
                           INPUT_PULLUP : INPUT);

  button_mode.init(mode_button_pin);

  // Configure the ButtonConfig with the event handler, and enable all higher
  // level events.
  ButtonConfig* ModeButtonConfig = button_mode.getButtonConfig();
  ModeButtonConfig->setEventHandler(handleEvent);
  ModeButtonConfig->setFeature(ButtonConfig::kFeatureClick);
  ModeButtonConfig->setFeature(ButtonConfig::kFeatureLongPress);
  ModeButtonConfig->setDebounceDelay(15);
  ModeButtonConfig->setClickDelay(100);
  ModeButtonConfig->setDoubleClickDelay(1000);
  ModeButtonConfig->setLongPressDelay(2000);

//  attachInterrupt(digitalPinToInterrupt(mode_button_pin), onModeButtonEvent, CHANGE );

#if defined(CONFIG_IDF_TARGET_ESP32)
  if (settings->adapter == ADAPTER_TTGO_T5S) {

    // Button(s) uses external pull up resistor.
    pinMode(SOC_BUTTON_UP_T5S,   INPUT);
    pinMode(SOC_BUTTON_DOWN_T5S, INPUT);

    if (settings->rotate == ROTATE_180) {
      button_up.init(SOC_BUTTON_DOWN_T5S);
      button_down.init(SOC_BUTTON_UP_T5S);
    } else {
      button_up.init(SOC_BUTTON_UP_T5S);
      button_down.init(SOC_BUTTON_DOWN_T5S);
    }

    ButtonConfig* UpButtonConfig = button_up.getButtonConfig();
    UpButtonConfig->setEventHandler(handleEvent);
    UpButtonConfig->setFeature(ButtonConfig::kFeatureClick);
    UpButtonConfig->setDebounceDelay(15);
    UpButtonConfig->setClickDelay(100);
    UpButtonConfig->setDoubleClickDelay(1000);
    UpButtonConfig->setLongPressDelay(2000);

    ButtonConfig* DownButtonConfig = button_down.getButtonConfig();
    DownButtonConfig->setEventHandler(handleEvent);
    DownButtonConfig->setFeature(ButtonConfig::kFeatureClick);
    DownButtonConfig->setDebounceDelay(15);
    DownButtonConfig->setClickDelay(100);
    DownButtonConfig->setDoubleClickDelay(1000);
    DownButtonConfig->setLongPressDelay(2000);

    if (settings->rotate == ROTATE_180) {
//      attachInterrupt(digitalPinToInterrupt(SOC_BUTTON_UP_T5S),   onDownButtonEvent, CHANGE);
//      attachInterrupt(digitalPinToInterrupt(SOC_BUTTON_DOWN_T5S), onUpButtonEvent,   CHANGE);
    } else {
//      attachInterrupt(digitalPinToInterrupt(SOC_BUTTON_UP_T5S),   onUpButtonEvent,   CHANGE);
//      attachInterrupt(digitalPinToInterrupt(SOC_BUTTON_DOWN_T5S), onDownButtonEvent, CHANGE);
    }
  }
#endif /* CONFIG_IDF_TARGET_ESP32 */

#if defined(CONFIG_IDF_TARGET_ESP32S3)
  if (settings->adapter == ADAPTER_WAVESHARE_PICO_2_7 ||
      settings->adapter == ADAPTER_WAVESHARE_PICO_2_7_V2) {
    pinMode(SOC_GPIO_PIN_KEY0, INPUT_PULLUP);
    pinMode(SOC_GPIO_PIN_KEY2, INPUT_PULLUP);

    if (settings->rotate == ROTATE_180) {
      button_up.init(SOC_GPIO_PIN_KEY0, HIGH);
      button_down.init(SOC_GPIO_PIN_KEY2, HIGH);
    } else {
      button_up.init(SOC_GPIO_PIN_KEY2, HIGH);
      button_down.init(SOC_GPIO_PIN_KEY0, HIGH);
    }

