lyusupov/SoftRF/software/firmware/source/SkyView/Platform_ESP32.cpp
    ButtonConfig* UpButtonConfig = button_up.getButtonConfig();
    UpButtonConfig->setEventHandler(handleEvent);
    UpButtonConfig->setFeature(ButtonConfig::kFeatureClick);
    UpButtonConfig->setFeature(ButtonConfig::kFeatureSuppressAfterClick);
    UpButtonConfig->setClickDelay(100);
    UpButtonConfig->setLongPressDelay(2000);

    ButtonConfig* DownButtonConfig = button_down.getButtonConfig();
    DownButtonConfig->setEventHandler(handleEvent);
    DownButtonConfig->setFeature(ButtonConfig::kFeatureClick);
    DownButtonConfig->setFeature(ButtonConfig::kFeatureSuppressAfterClick);
    DownButtonConfig->setClickDelay(100);
    DownButtonConfig->setLongPressDelay(2000);
  }
#endif /* CONFIG_IDF_TARGET_ESP32S3 */

#if defined(CONFIG_IDF_TARGET_ESP32P4)
  if (settings->adapter == ADAPTER_WAVESHARE_PI_HAT_2_7 ||
      settings->adapter == ADAPTER_WAVESHARE_PI_HAT_2_7_V2) {
    pinMode(SOC_GPIO_BUTTON_UP,   INPUT_PULLUP);
    pinMode(SOC_GPIO_BUTTON_DOWN, INPUT_PULLUP);

    button_up.init(SOC_GPIO_BUTTON_UP,     HIGH);
    button_down.init(SOC_GPIO_BUTTON_DOWN, HIGH);

    ButtonConfig* UpButtonConfig = button_up.getButtonConfig();
    UpButtonConfig->setEventHandler(handleEvent);
    UpButtonConfig->setFeature(ButtonConfig::kFeatureClick);
    UpButtonConfig->setFeature(ButtonConfig::kFeatureSuppressAfterClick);
    UpButtonConfig->setClickDelay(100);
    UpButtonConfig->setLongPressDelay(2000);

    ButtonConfig* DownButtonConfig = button_down.getButtonConfig();
    DownButtonConfig->setEventHandler(handleEvent);
    DownButtonConfig->setFeature(ButtonConfig::kFeatureClick);
    DownButtonConfig->setFeature(ButtonConfig::kFeatureSuppressAfterClick);
    DownButtonConfig->setClickDelay(100);
    DownButtonConfig->setLongPressDelay(2000);
  }
#endif /* CONFIG_IDF_TARGET_ESP32P4 */
}

static void ESP32_Button_loop()
{
  button_mode.check();

  if (settings->adapter == ADAPTER_TTGO_T5S                ||
#if defined(CONFIG_IDF_TARGET_ESP32P4)
      settings->adapter == ADAPTER_WAVESHARE_PI_HAT_2_7    ||
      settings->adapter == ADAPTER_WAVESHARE_PI_HAT_2_7_V2 ||
#endif /* CONFIG_IDF_TARGET_ESP32P4 */
      settings->adapter == ADAPTER_WAVESHARE_PICO_2_7      ||
      settings->adapter == ADAPTER_WAVESHARE_PICO_2_7_V2) {
    button_up.check();
    button_down.check();
  }
}

static void ESP32_Button_fini()
{
  int mode_button_pin = SOC_BUTTON_MODE_DEF;

#if defined(CONFIG_IDF_TARGET_ESP32)
  if (settings->adapter == ADAPTER_TTGO_T5S) {
    mode_button_pin = SOC_BUTTON_MODE_T5S;
//    detachInterrupt(digitalPinToInterrupt(SOC_BUTTON_UP_T5S));
//    detachInterrupt(digitalPinToInterrupt(SOC_BUTTON_DOWN_T5S));
  }
#endif /* CONFIG_IDF_TARGET_ESP32 */

#if defined(CONFIG_IDF_TARGET_ESP32S3)
  if (settings->adapter == ADAPTER_WAVESHARE_PICO_2_7 ||
      settings->adapter == ADAPTER_WAVESHARE_PICO_2_7_V2) {
    mode_button_pin = SOC_GPIO_PIN_KEY1;
  }
#endif /* CONFIG_IDF_TARGET_ESP32S3 */

#if defined(CONFIG_IDF_TARGET_ESP32P4)
  if (settings->adapter == ADAPTER_WAVESHARE_PI_HAT_2_7 ||
      settings->adapter == ADAPTER_WAVESHARE_PI_HAT_2_7_V2) {
    mode_button_pin = SOC_GPIO_BUTTON_MODE;
  }
#endif /* CONFIG_IDF_TARGET_ESP32P4 */

//  detachInterrupt(digitalPinToInterrupt(mode_button_pin));
  while (digitalRead(mode_button_pin) == LOW);
}

static void ESP32_WDT_setup()
{
  enableLoopWDT();
}

static void ESP32_WDT_fini()
{
  disableLoopWDT();
}

#if defined(CONFIG_IDF_TARGET_ESP32P4) && defined(USE_USB_HOST)

#include "libusb.h"
#include "rtl-sdr.h"

#include <mode-s.h>
#include <sdr/common.h>

#include "freertos/ringbuf.h"
#include "esp_heap_caps.h"

#define MODE_S_PREAMBLE_US      8
#define MODE_S_LONG_MSG_BITS    112
#define MODE_S_SHORT_MSG_BITS   56
#define MODE_S_ASYNC_BUF_NUMBER 3
#define MODE_S_DATA_LEN         65536
#define MODE_S_FULL_LEN         (MODE_S_PREAMBLE_US + MODE_S_LONG_MSG_BITS)

#define SDR_RINGBUFFER_SIZE     (1024 * 1024)
#define RTLSDR_TASK_PRIORITY    10 // 4

rtlsdr_dev_t *rtlsdr_dev;
TaskHandle_t rtlsdr_task_handle = NULL;

mag_t *mag;

int do_exit = 0;

mode_s_t state;

char STR_TMP_BUFFER[128];

StaticRingbuffer_t *buffer_struct = nullptr;
uint8_t *buffer_storage = nullptr;
RingbufHandle_t s_ringbuf_sdr;
bool rb_reader_is_ready = false;

extern int rtlsdr_is_connected;
extern mag_t maglut[129*129];

void on_msg(mode_s_t *self, struct mode_s_msg *mm) {

    MODES_NOTUSED(self);

#if 0
    if (self->check_crc == 0 || mm->crcok) {
      sprintf(STR_TMP_BUFFER, "%02d %03d %02x%02x%02x\r\n",
                              mm->msgtype, mm->msgbits, mm->aa1, mm->aa2, mm->aa3);

      Serial.write(STR_TMP_BUFFER, strlen(STR_TMP_BUFFER));
      Serial.flush();
    }
#endif

    if (self->check_crc == 0 || mm->crcok) {

//    printf("%02d %03d %02x%02x%02x\r\n", mm->msgtype, mm->msgbits, mm->aa1, mm->aa2, mm->aa3);

        int acfts_in_sight = 0;
        struct mode_s_aircraft *a = state.aircrafts;

        while (a) {
          acfts_in_sight++;
          a = a->next;
        }

        if (acfts_in_sight < MAX_TRACKING_OBJECTS) {
          interactiveReceiveData(self, mm);
        }
    }
}

void process_iq8u_buffer(uint8_t *buf, size_t size) {

    for (int j=0; j<size; j+=2) {
      int8_t i = buf[j    ] - 127;
      int8_t q = buf[j + 1] - 127;

      if (i < 0) i = -i;
      if (q < 0) q = -q;

      mag[(MODE_S_FULL_LEN-1)*2 + (j>>1)] = maglut[i*129+q];
    }

    mode_s_detect(&state, mag, (size + (MODE_S_FULL_LEN-1)*4) / 2, on_msg);
    memcpy(mag, mag + size/2, (MODE_S_FULL_LEN-1)*2);
}

static void rtlsdr_callback(unsigned char *buf, uint32_t len, void *ctx)
{
  if (do_exit)
    return;

  if (rtlsdr_is_connected == 0) {
    do_exit = 1;
    rtlsdr_cancel_async(rtlsdr_dev);
  }

  if (rb_reader_is_ready) {
    if (xRingbufferSend(s_ringbuf_sdr, buf, len, pdMS_TO_TICKS(10)) != pdTRUE) {
        Serial.println("Failed to send message into ring buffer!");
    }
  }
}

void rtlsdr_task()
{
  while (true)
  {
    while (rtlsdr_is_connected == 0) {
      delay(10);
    }

