lyusupov/SoftRF/software/firmware/source/SkyView/Platform_ESP32.cpp
    int i;
    char vendor[256], product[256], serial[256];

    int device_count = rtlsdr_get_device_count();

    fprintf(stderr, "Found %d device(s):\n", device_count);
	for (i = 0; i < device_count; i++) {
		rtlsdr_get_device_usb_strings(i, vendor, product, serial);
		fprintf(stderr, "  %d:  %s, %s, SN: %s\n", i, vendor, product, serial);
	}

    int r = rtlsdr_open(&rtlsdr_dev, 0);
    if (r < 0) {
        fprintf(stderr, "Failed to open rtlsdr device #%d.\n", 0);
    }

    r = rtlsdr_set_sample_rate(rtlsdr_dev, 2000000);
    if (r < 0) {
        fprintf(stderr, "WARNING: Failed to set sample rate.\n");
    } else {
        fprintf(stderr, "Sampling at %u S/s.\n", 2000000);
    }

    r = rtlsdr_set_center_freq(rtlsdr_dev, 1090000000);
    if (r < 0) {
        fprintf(stderr, "WARNING: Failed to set center freq.\n");
    } else {
        fprintf(stderr, "Tuned to %u Hz.\n", 1090000000);
    }
#if 1
    r = rtlsdr_set_tuner_gain_mode(rtlsdr_dev, 0);
    if (r != 0)
    {
        fprintf(stderr, "WARNING: Failed to set tuner gain.\r\n");
    }
    else
    {
        fprintf(stderr, "Tuner gain set to automatic.\r\n");
    }
#else
    r = rtlsdr_set_tuner_gain_mode(rtlsdr_dev, 1);
    if (r < 0) {
        fprintf(stderr, "WARNING: Failed to enable manual gain.\r\n");
    }

    int gain = nearest_gain(rtlsdr_dev, 316);
    r = rtlsdr_set_tuner_gain(rtlsdr_dev, gain);
    if (r != 0) {
        fprintf(stderr, "WARNING: Failed to set tuner gain.\r\n");
    } else {
        fprintf(stderr, "Tuner gain set to %0.2f dB.\r\n", gain/10.0);
    }
#endif
    r = rtlsdr_reset_buffer(rtlsdr_dev);
    if (r < 0) {
        fprintf(stderr, "WARNING: Failed to reset buffers.\n");}

    r = rtlsdr_read_async(rtlsdr_dev, rtlsdr_callback, 0,
                          MODE_S_ASYNC_BUF_NUMBER, MODE_S_DATA_LEN);

    rtlsdr_close(rtlsdr_dev);

    do_exit = 0;
  }
}

static void ESP32PX_USB_setup()
{
  mode_s_init(&state);

  mag = (mag_t *) ps_malloc((MODE_S_DATA_LEN + (MODE_S_FULL_LEN-1)*4) / (sizeof(mag_t) * 2));

  buffer_struct = (StaticRingbuffer_t *)heap_caps_malloc(
                                                    sizeof(StaticRingbuffer_t),
                                                    MALLOC_CAP_SPIRAM);
  buffer_storage = (uint8_t *)heap_caps_malloc(SDR_RINGBUFFER_SIZE,
                                               MALLOC_CAP_SPIRAM);
  s_ringbuf_sdr = xRingbufferCreateStatic(SDR_RINGBUFFER_SIZE,
                                          RINGBUF_TYPE_BYTEBUF,
                                          buffer_storage,
                                          buffer_struct);
  if (s_ringbuf_sdr == NULL) {
     fprintf(stderr, "xRingbufferCreateStatic failure\n");
     while (true);
  }

  usbhost_begin();

  if (libusb_init() == 1) {
	BaseType_t rtlsdr_task_status = xTaskCreatePinnedToCore(
		(TaskFunction_t) rtlsdr_task,
		"rtlsdr_reader",
		4096,
		NULL,
		RTLSDR_TASK_PRIORITY,
		&rtlsdr_task_handle,
		CONFIG_ARDUINO_RUNNING_CORE
	);

	if (rtlsdr_task_status != pdPASS) {
		ESP_LOGE("rtlsdr","Error creating rtlsdr reader task!");
		while (1) {
		  vTaskDelay(1000 / portTICK_PERIOD_MS);
		}
	}
  }
}

#include <TinyGPS++.h>

#include "GDL90Helper.h"
#include "NMEAHelper.h"
#include "TrafficHelper.h"

#define MODES_TASK_INTERVAL 998

unsigned long ModeS_Time_Marker = 0;

bool es1090_decode(void *pkt, traffic_t *this_aircraft, traffic_t *fop) {

  struct mode_s_aircraft *a = (struct mode_s_aircraft *) pkt;

  fop->ID        = a->addr;
  fop->IDType = ADDR_TYPE_ICAO;

  fop->latitude  = a->lat;
  fop->longitude = a->lon;
  if (a->unit == MODE_S_UNIT_FEET) {
    fop->altitude = a->altitude / _GPS_FEET_PER_METER;
  } else {
    fop->altitude = a->altitude;
  }

  fop->AlarmLevel = ALARM_LEVEL_NONE;

  fop->Track = a->track;
//  fop->ClimbRate = a->vert_rate;                              /* TBD */
  fop->TurnRate = 0;                                            /* TBD */
  fop->GroundSpeed = a->speed;
  fop->AcftType = GDL90_TO_AT(a->aircraft_type);

  /* sizeof(mdb.callsign) = 9 ; sizeof(fop->callsign) = 8 */
  memcpy(fop->callsign, a->flight, sizeof(fop->callsign));

  fop->timestamp = now();

  return true;
}

static void ESP32PX_USB_loop()
{
  if (!rb_reader_is_ready) { rb_reader_is_ready = true; }

  if (rtlsdr_is_connected == 1) {
    size_t receivedMessageSize;
    uint8_t *receivedMessage;
    receivedMessage = (uint8_t *) xRingbufferReceiveUpTo(s_ringbuf_sdr,
                                                         &receivedMessageSize,
                                                         pdMS_TO_TICKS(1000),
                                                         MODE_S_DATA_LEN);
    if (receivedMessage != NULL) {
        process_iq8u_buffer(receivedMessage, receivedMessageSize);
        vRingbufferReturnItem(s_ringbuf_sdr, (void*) receivedMessage);
    } else {
        Serial.println("Failed to receive message from ring buffer!");
    }
  }

  if (millis() - ModeS_Time_Marker > MODES_TASK_INTERVAL) {
    struct mode_s_aircraft *a;

    for (a = state.aircrafts; a; a = a->next) {
#if 0
      Serial.print("even_cprtime = ");  Serial.print(a->even_cprtime);
      Serial.print(" ");
      Serial.print("odd_cprtime = ");   Serial.println(a->odd_cprtime);
#endif
      if (a->even_cprtime && a->odd_cprtime &&
          abs((long) (a->even_cprtime - a->odd_cprtime)) <= MODE_S_INTERACTIVE_TTL * 1000 ) {
#if 0
        fo = EmptyFO;
        if (es1090_decode(a, &ThisAircraft, &fo)) {
          Traffic_Update(&fo);
          Traffic_Add();
        }
#else
        Serial.print("addr = "); Serial.print(a->addr, HEX); Serial.print(" ");
        Serial.print("lat = ");  Serial.print(a->lat);       Serial.print(" ");
        Serial.print("lon = ");  Serial.println(a->lon);
#endif
      }
    }

    interactiveRemoveStaleAircrafts(&state);

    ModeS_Time_Marker = millis();
  }
}

static void ESP32PX_USB_fini()
{
  if (libusb_init() == 1) {
      do_exit = 1;
      vTaskDelete( rtlsdr_task_handle );
  }

