lyusupov/SoftRF/software/firmware/source/SkyView/Platform_ESP32.cpp
  vRingbufferDelete(s_ringbuf_sdr);
  free(buffer_storage);
  free(buffer_struct);
  free(mag);
}

static int ESP32PX_USB_available()
{
  int rval = 0;

  return rval;
}

static int ESP32PX_USB_read()
{
  int rval = -1;

  return rval;
}

static size_t ESP32PX_USB_write(const uint8_t *buffer, size_t size)
{
  size_t rval = size;

  return rval;
}

IODev_ops_t ESP32PX_USB_ops = {
  "ESP32PX USB",
  ESP32PX_USB_setup,
  ESP32PX_USB_loop,
  ESP32PX_USB_fini,
  ESP32PX_USB_available,
  ESP32PX_USB_read,
  ESP32PX_USB_write
};
#endif /* CONFIG_IDF_TARGET_ESP32P4 */

const SoC_ops_t ESP32_ops = {
#if defined(CONFIG_IDF_TARGET_ESP32)
  SOC_ESP32,
  "ESP32",
#elif defined(CONFIG_IDF_TARGET_ESP32S2)
  SOC_ESP32S2,
  "ESP32-S2",
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
  SOC_ESP32S3,
  "ESP32-S3",
#elif defined(CONFIG_IDF_TARGET_ESP32C3)
  SOC_ESP32C3,
  "ESP32-C3",
#elif defined(CONFIG_IDF_TARGET_ESP32C5)
  SOC_ESP32C5,
  "ESP32-C5",
#elif defined(CONFIG_IDF_TARGET_ESP32C6)
  SOC_ESP32C6,
  "ESP32-C6",
#elif defined(CONFIG_IDF_TARGET_ESP32P4)
  SOC_ESP32P4,
  "ESP32-P4",
#else
#error "This ESP32 family build variant is not supported!"
#endif /* CONFIG_IDF_TARGET_ESP32-S2-S3-C3-C5-C6-P4 */
  ESP32_setup,
  ESP32_post_init,
  ESP32_loop,
  ESP32_fini,
  ESP32_reset,
  ESP32_getChipId,
  ESP32_getFreeHeap,
  ESP32_EEPROM_begin,
  ESP32_EEPROM_extension,
  ESP32_WiFi_setOutputPower,
  ESP32_WiFi_hostname,
  ESP32_swSer_begin,
  ESP32_swSer_enableRx,
  ESP32_maxSketchSpace,
  ESP32_WiFiUDP_stopAll,
  ESP32_Battery_setup,
  ESP32_Battery_voltage,
  ESP32_Display_setup,
  ESP32_Display_loop,
  ESP32_Display_fini,
  ESP32_Display_is_ready,
  ESP32_Display_update,
  ESP32_WiFi_Receive_UDP,
  ESP32_WiFi_clients_count,
  ESP32_DB_init,
  ESP32_DB_query,
  ESP32_DB_fini,
  ESP32_TTS,
  ESP32_Button_setup,
  ESP32_Button_loop,
  ESP32_Button_fini,
  ESP32_WDT_setup,
  ESP32_WDT_fini,
#if !defined(CONFIG_IDF_TARGET_ESP32S2)
  &ESP32_Bluetooth_ops,
#else
  NULL,
#endif /* CONFIG_IDF_TARGET_ESP32S2 */
#if defined(CONFIG_IDF_TARGET_ESP32P4) && defined(USE_USB_HOST)
  &ESP32PX_USB_ops,
#else
  NULL,
#endif /* CONFIG_IDF_TARGET_ESP32P4 */
};

#endif /* ESP32 */
